notes/software-development/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Software Development</title>
<meta name="generator" content="Org Mode" />
<meta name="author" content="Florian Winkelbauer">
<link rel="stylesheet" href="/site.css" type="text/css">
</head>
<body>
<div id="preamble" class="status">
<nav>
<a href="/">Home</a>
<a href="/notes">Notes</a>
<a href="/posts">Posts</a>
<a href="/projects">Projects</a>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Software Development</h1>
</header><p>
This post contains a list of notes about systems and software development.
</p>

<div id="outline-container-orgbc0746d" class="outline-2">
<h2 id="orgbc0746d">Antifragility (Nassim Nicholas Taleb)</h2>
<div class="outline-text-2" id="text-orgbc0746d">
<p>
An antifragile system benefits from disorder
</p>

<ul class="org-ul">
<li>Have options (instead of obligations)</li>
<li>Create a situation with low downside and high upside</li>
<li>Create systems with slack</li>
</ul>

<p>
<b>Nonlinear events</b>
</p>

<ul class="org-ul">
<li>Convex: a smiling graph. More potential upside than downside (positive Black
Swan)</li>
<li>Concave: a frowning graph. More potential downside than upside (negative Black
Swan)</li>
<li>You are robust if doubling exposure doubles harm</li>
<li>You are fragile if doubling exposure more than doubles harm</li>
<li>A single 100 pound stone hurts more than 100 one pound stones</li>
<li>A function is concave if the average function value is lower than the
function of the average value</li>
<li>A function is convex if the average function value is higher than the function
of the average value</li>
</ul>

<p>
<b>Example</b>
</p>

<p>
Traffic is a function, which depends on the amount of cars. This function is
nonlinear (concave), as the following two situations create different outputs:
</p>

<ul class="org-ul">
<li>One hour of 8.000 cars, followed by one hour of 12.000 cars</li>
<li>Two hours of 10.000 cars</li>
</ul>

<p>
<b>Important:</b> Don't confuse x with f(x).
</p>
</div>
</div>

<div id="outline-container-org0a3ee52" class="outline-2">
<h2 id="org0a3ee52">Meltdown (Chris Clearfield, András Tilcsik)</h2>
<div class="outline-text-2" id="text-org0a3ee52">
<p>
<b>Why our systems fail and what we can do about it</b>
</p>

<p>
Complexity and coupling increase the chance of big errors. In these systems,
small problems and minor issues can accumulate into an unforeseen meltdown.
</p>

<p>
In the past, nuclear power plants were one of only a few systems which were both
complex and highly coupled. Over the last years more and more systems entered
this domain.
</p>

<p>
How to deal with these systems:
</p>

<ul class="org-ul">
<li>Introduce slack</li>
<li>Reduce moving parts</li>
<li>Replace indirect feedback with direct feedback
<ul class="org-ul">
<li>Example of indirect feedback: An indicator light that shows that a valve was
instructed to close</li>
<li>Example of direct feedback: An indicator light which shows the actual state
(open/closed) of a valve</li>
</ul></li>
</ul>

<p>
Techniques:
</p>

<ul class="org-ul">
<li>Aviation and medical institutions use "near miss reports" to deal with small
issues before they can spiral out of control</li>
<li>Use hindsight bias by performing a premortem. Imagine that the project is
completed and that it was a complete failure. What were the reasons why it
failed?</li>
<li>Subjective Probability Interval Estimates (SPIES): Estimate the probability of
several outcomes</li>
</ul>

<p>
Lessons:
</p>

<ul class="org-ul">
<li>Charm school (Everyone should be able to express concern)
<ul class="org-ul">
<li>Get attention</li>
<li>Express your concern</li>
<li>State the perceived problem</li>
<li>Propose a solution</li>
<li>Ask for agreement</li>
</ul></li>
<li>Soften power cues
<ul class="org-ul">
<li>This makes you more approachable, which can encourage people to speak their
mind</li>
</ul></li>
<li>Leaders speak last
<ul class="org-ul">
<li>Encourage discussion about different solutions</li>
<li>Not encouraging a discussion can be compared to discouraging a discussion</li>
</ul></li>
</ul>

<p>
Diverse groups are "better" because group members are more skeptical which in
turn makes it more likely to catch small errors.
</p>
</div>
</div>

<div id="outline-container-org7f724bd" class="outline-2">
<h2 id="org7f724bd">Decision Logs</h2>
<div class="outline-text-2" id="text-org7f724bd">
<p>
Create logs that hold the following information:
</p>

<ul class="org-ul">
<li>Problem you are deciding on</li>
<li>Involved people</li>
<li>What did you choose? Why? Risks?</li>
<li>What other things have you considered? Why didn't you choose them?</li>
</ul>

<p>
Michael Nygard described his decision log structure in <a href="https://cognitect.com/blog/2011/11/15/documenting-architecture-decisions">this blog post</a>:
</p>

<ul class="org-ul">
<li><b>Context:</b> Describe the forces at play</li>
<li><b>Decision:</b> Your response to these forces</li>
<li><b>Status:</b> The decision status (e.g. "proposed")</li>
<li><b>Consequences:</b> What happened afterwards?</li>
</ul>
</div>
</div>

<div id="outline-container-org524d6b1" class="outline-2">
<h2 id="org524d6b1">Documentation</h2>
<div class="outline-text-2" id="text-org524d6b1">
<ul class="org-ul">
<li><a href="https://arc42.org/documentation/">https://arc42.org/documentation/</a></li>
<li>Write documentation if
<ul class="org-ul">
<li>The thing you are documenting does not change often</li>
<li>Your documentation will be useful to a large group of people</li>
</ul></li>
<li><a href="https://www.writethedocs.org/videos/eu/2017/the-four-kinds-of-documentation-and-why-you-need-to-understand-what-they-are-daniele-procida/">Four Kinds of Documentation</a>
<ul class="org-ul">
<li><b>Tutorial:</b> learning-oriented; a getting started guide</li>
<li><b>How-To Guide:</b> goal-oriented; how to solve a specific problem</li>
<li><b>Explanation:</b> understanding-oriented; provides background and context</li>
<li><b>Reference:</b> information-oriented; describes inner processes</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgb29bebe" class="outline-2">
<h2 id="orgb29bebe">The Phoenix/Unicorn Project (Gene Kim)</h2>
<div class="outline-text-2" id="text-orgb29bebe">
<p>
<b>Three Ways</b>
</p>

<ul class="org-ul">
<li>System Thinking</li>
<li>Amplify Feedback Loops</li>
<li>Culture Of Continual Experimentation And Learning</li>
</ul>

<p>
<b>Five Types Of Work</b>
</p>

<ul class="org-ul">
<li>Business Projects</li>
<li>Internal IT Projects</li>
<li>Changes generated by the above</li>
<li>Unplanned Work</li>
</ul>

<p>
<b>Five Ideals</b>
</p>

<ul class="org-ul">
<li>Locality and Simplicity</li>
<li>Focus, Flow, and Joy</li>
<li>Improvement of Daily Work</li>
<li>Psychological Safety</li>
<li>Customer Focus</li>
</ul>
</div>
</div>

<div id="outline-container-org2e8cbed" class="outline-2">
<h2 id="org2e8cbed">Accelerate (Nicole Forsgren PhD, Jez Humble and Gene Kim)</h2>
<div class="outline-text-2" id="text-org2e8cbed">
<p>
The book outlines 24 capabilities that drive improvements software delivery
performance:
</p>

<p>
<b>Continuous Delivery</b>
</p>

<ul class="org-ul">
<li>Version control</li>
<li>Deployment automation</li>
<li>Continuous integration</li>
<li>Trunk-based development</li>
<li>Test automation</li>
<li>Test data management</li>
<li>Shift left on security</li>
<li>Continuous delivery</li>
</ul>

<p>
<b>Architecture</b>
</p>

<ul class="org-ul">
<li>Loosely coupled architecture</li>
<li>Empowered teams</li>
</ul>

<p>
<b>Product and Process</b>
</p>

<ul class="org-ul">
<li>Customer feedback</li>
<li>Value stream</li>
<li>Working in small batches</li>
<li>Team experimentation</li>
</ul>

<p>
<b>Lean Management and Monitoring</b>
</p>

<ul class="org-ul">
<li>Change approval processes</li>
<li>Monitoring</li>
<li>Proactive notifications</li>
<li>WIP limits</li>
<li>Visualizing work</li>
</ul>

<p>
<b>Cultural</b>
</p>

<ul class="org-ul">
<li>Westrum organizational culture</li>
<li>Supporting learning</li>
<li>Collaboration among teams</li>
<li>Job satisfaction</li>
<li>Transformational leadership</li>
</ul>
</div>
</div>
