content/notes/software-development.org
* CAP Theorem

- Consistency
- Availability
- Partition tolerance

This theorem states that given a network partition (a split brain situation), a
distributed system can either favor consistency or availability.

*Example:* Imagine that you are part of a fully remote wedding. Let's imagine
that you answer "the big question" with yes and let's imagine that your
phone/internet connection breaks before your significant other can answer the
same question. What do you do? Do you say that you are married/not married (in
which case you would favor availability) or do you say "I don't know" (in which
case you would favor consistency).

The PACELC theorem is an extension to the CAP theorem: In case of a network
*P*artition, one has to choose between *A*vailability and *C*onsistency,
*E*lse, when a system does not have a partition, one has to choose between
*L*atency and *C*onsistency.

Martin Kleppmann posted an [[https://martin.kleppmann.com/2015/05/11/please-stop-calling-databases-cp-or-ap.html][interesting article]] in which he explains that neither
CAP nor PACELC are a good way to think about distributed systems.

* Idealcast Podcast

https://itrevolution.com/the-idealcast-podcast/

*Jeffrey Fredrick (Episode 14)*

Employee satisfaction can indicate the performance of an organization. Ask:

- Are you happy?
- Are you able to do work that you are proud of?

*Scott Havens (Episode 22 & 23)*

- State management techniques used in functional programming can be used to
  scale large architecture such as Wal-Mart's warehouse system
- Working with event streams as input and output makes a system decoupled,
  easier to test and more understandable
- A pure function can be replaced by a lookup table
- Scott mentions a story about how they recovered from a disaster involving the
  death of a Kafka cluster
- He also tells the story of how he replaced a synchronous call graph involving
  23 procedures with asynchronous computation
- Category theory is not too important in your day-to-day use of functional
  patterns

* Pilot Decision Management (Clifford Agius)

https://www.youtube.com/watch?v=QNA9EExd8lQ

The TDODAR framework:

*Time*

- Is it an emergency? Do we have to act quickly?
- Do we need to and can we make more time?
- Do we have time for a cup of coffee?
- Start a stopwatch and make sure you come back to the "T" to check if things
  change

*Diagnosis*

What do we think happened?

- Discuss the symptoms
- Ask open questions
- Find some information to tell me this is not XYZ
- Agree on the issue to be tackled
- Make it quick and concise, the clock is ticking!

*Options*

What should we do?

- Brainstorm possible options
- Tell people "Give me another option!" if the discussion dries up
- Take input from all members of the team and outside sources
- No such thing as a silly idea. Verbalize everything
- Don't drag it out, be quick. Often the first ideas are the best anyway

*Decide*

What are we going to do?

- As a team decide what is the correct or chosen path
- Don't spend too much time deciding, pick an option and go with it
- *State the decision*

*Assign*

Assign tasks to the members of the team.

- Team leader assigns tasks
- Make tasks short and within the skills of that team member
- It is not a race!
- Complete your task as well as you can but don't delay completion
- If you can't complete ask for help
- Consider overload

*Review*

- Has the issue been resolved?
- Do we still have time?
- Quickly repeat TDODAR to see if actions have changed the answer
- Is it still a good decision?

* Sharpening the Tools (Dan North)

https://www.infoq.com/presentations/Sharpening-the-Tools

*Novice Programmer*

Need rules (*not patterns*) to guide their way: Don't ask. Follow this advice
and you will be fine.

*Advanced Beginner*

Do not follow the rules! Find out why the rules are the rules. We are starting
to get context - we experience how stuff works.

*Competent*

You become goal oriented. This is a time based thing. Most people become
competent if they keep doing something.

*Proficient*

This is a deliberate step. Things start to become intuition. Patterns start to
become useful. "How can I make this better?"

*Expert*

You are operating of instinct. You don't think about rules, you "just know".
This is critical: You don't know how you come up with your decision.

* Learn to love meetings (Dr. Neil Roodyn)

https://www.youtube.com/watch?v=ppfLUFO-hwc

- Have a timeline and an agenda
- "Check-in": Say your name, how you feel and your expectations at the beginning
  of a meeting
- Decisions are made via votes
  - Yes
  - I don't care
  - No (you have to provide an alternative to discuss and vote)
- A decision can be postponed through an "investigation". This is used to ask
  clarifying questions
- They were using a dashboard to display metrics to analyze how the meeting time
  was spent (e.g. fiddling with the projector, actual discussions and so on)
- Lean Coffee

* Preventing the Collapse of Civilization (Jonathan Blow)

https://www.youtube.com/watch?v=pW-SOdj4Kkk

- Technology on its own will degrade. It needs constant effort to improve and
  not lose technology
- Without generational transfer, civilizations die
- How productive are programming languages at a higher abstraction level (think
  C#, Haskell or JavaScript) *really*? The first version of Unix was written
  in three weeks
- We keep adding complexity, which means that each individual knows less and
  less about a system
- We are reducing development time by using existing tools and frameworks, but
  we are also giving up capability. This is fine in isolation, but it might
  become a problem if everyone does it
- Only a handful of people *really* know how a CPU works
- Our tools change our thought process

* Don't Walk Away from Complexity, Run (Venkat Subramaniam)

https://www.youtube.com/watch?v=4MEKu2TcEHM

- Two kinds of code frustrate him:
  - One that won't work
  - One that works, but shouldn't
- Shared mutability is the devil's work
- Using a library is like dating, using a framework is like getting married

