notes/software-development/index.html

<div id="outline-container-orgf677f49" class="outline-2">
<h2 id="orgf677f49">CAP Theorem</h2>
<div class="outline-text-2" id="text-orgf677f49">
<ul class="org-ul">
<li>Consistency</li>
<li>Availability</li>
<li>Partition tolerance</li>
</ul>

<p>
This theorem states that given a network partition (a split brain situation), a
distributed system can either favor consistency or availability.
</p>

<p>
<b>Example:</b> Imagine that you are part of a fully remote wedding. Let's imagine
that you answer "the big question" with yes and let's imagine that your
phone/internet connection breaks before your significant other can answer the
same question. What do you do? Do you say that you are married/not married (in
which case you would favor availability) or do you say "I don't know" (in which
case you would favor consistency).
</p>

<p>
The PACELC theorem is an extension to the CAP theorem: In case of a network
*P*artition, one has to choose between *A*vailability and *C*onsistency,
*E*lse, when a system does not have a partition, one has to choose between
*L*atency and *C*onsistency.
</p>

<p>
Martin Kleppmann posted an <a href="https://martin.kleppmann.com/2015/05/11/please-stop-calling-databases-cp-or-ap.html">interesting article</a> in which he explains that neither
CAP nor PACELC are a good way to think about distributed systems.
</p>
</div>
</div>

<div id="outline-container-org2144072" class="outline-2">
<h2 id="org2144072">Idealcast Podcast</h2>
<div class="outline-text-2" id="text-org2144072">
<p>
<a href="https://itrevolution.com/the-idealcast-podcast/">https://itrevolution.com/the-idealcast-podcast/</a>
</p>

<p>
<b>Jeffrey Fredrick (Episode 14)</b>
</p>

<p>
Employee satisfaction can indicate the performance of an organization. Ask:
</p>

<ul class="org-ul">
<li>Are you happy?</li>
<li>Are you able to do work that you are proud of?</li>
</ul>

<p>
<b>Scott Havens (Episode 22 &amp; 23)</b>
</p>

<ul class="org-ul">
<li>State management techniques used in functional programming can be used to
scale large architecture such as Wal-Mart's warehouse system</li>
<li>Working with event streams as input and output makes a system decoupled,
easier to test and more understandable</li>
<li>A pure function can be replaced by a lookup table</li>
<li>Scott mentions a story about how they recovered from a disaster involving the
death of a Kafka cluster</li>
<li>He also tells the story of how he replaced a synchronous call graph involving
23 procedures with asynchronous computation</li>
<li>Category theory is not too important in your day-to-day use of functional
patterns</li>
</ul>
</div>
</div>

<div id="outline-container-org637dde5" class="outline-2">
<h2 id="org637dde5">Pilot Decision Management (Clifford Agius)</h2>
<div class="outline-text-2" id="text-org637dde5">
<p>
<a href="https://www.youtube.com/watch?v=QNA9EExd8lQ">https://www.youtube.com/watch?v=QNA9EExd8lQ</a>
</p>

<p>
The TDODAR framework:
</p>

<p>
<b>Time</b>
</p>

<ul class="org-ul">
<li>Is it an emergency? Do we have to act quickly?</li>
<li>Do we need to and can we make more time?</li>
<li>Do we have time for a cup of coffee?</li>
<li>Start a stopwatch and make sure you come back to the "T" to check if things
change</li>
</ul>

<p>
<b>Diagnosis</b>
</p>

<p>
What do we think happened?
</p>

<ul class="org-ul">
<li>Discuss the symptoms</li>
<li>Ask open questions</li>
<li>Find some information to tell me this is not XYZ</li>
<li>Agree on the issue to be tackled</li>
<li>Make it quick and concise, the clock is ticking!</li>
</ul>

<p>
<b>Options</b>
</p>

<p>
What should we do?
</p>

<ul class="org-ul">
<li>Brainstorm possible options</li>
<li>Tell people "Give me another option!" if the discussion dries up</li>
<li>Take input from all members of the team and outside sources</li>
<li>No such thing as a silly idea. Verbalize everything</li>
<li>Don't drag it out, be quick. Often the first ideas are the best anyway</li>
</ul>

<p>
<b>Decide</b>
</p>

<p>
What are we going to do?
</p>

<ul class="org-ul">
<li>As a team decide what is the correct or chosen path</li>
<li>Don't spend too much time deciding, pick an option and go with it</li>
<li><b>State the decision</b></li>
</ul>

<p>
<b>Assign</b>
</p>

<p>
Assign tasks to the members of the team.
</p>

<ul class="org-ul">
<li>Team leader assigns tasks</li>
<li>Make tasks short and within the skills of that team member</li>
<li>It is not a race!</li>
<li>Complete your task as well as you can but don't delay completion</li>
<li>If you can't complete ask for help</li>
<li>Consider overload</li>
</ul>

<p>
<b>Review</b>
</p>

<ul class="org-ul">
<li>Has the issue been resolved?</li>
<li>Do we still have time?</li>
<li>Quickly repeat TDODAR to see if actions have changed the answer</li>
<li>Is it still a good decision?</li>
</ul>
</div>
</div>

<div id="outline-container-orgc3f6ccf" class="outline-2">
<h2 id="orgc3f6ccf">Sharpening the Tools (Dan North)</h2>
<div class="outline-text-2" id="text-orgc3f6ccf">
<p>
<a href="https://www.infoq.com/presentations/Sharpening-the-Tools">https://www.infoq.com/presentations/Sharpening-the-Tools</a>
</p>

<p>
<b>Novice Programmer</b>
</p>

<p>
Need rules (<b>not patterns</b>) to guide their way: Don't ask. Follow this advice
and you will be fine.
</p>

<p>
<b>Advanced Beginner</b>
</p>

<p>
Do not follow the rules! Find out why the rules are the rules. We are starting
to get context - we experience how stuff works.
</p>

<p>
<b>Competent</b>
</p>

<p>
You become goal oriented. This is a time based thing. Most people become
competent if they keep doing something.
</p>

<p>
<b>Proficient</b>
</p>

<p>
This is a deliberate step. Things start to become intuition. Patterns start to
become useful. "How can I make this better?"
</p>

<p>
<b>Expert</b>
</p>

<p>
You are operating of instinct. You don't think about rules, you "just know".
This is critical: You don't know how you come up with your decision.
</p>
</div>
</div>

<div id="outline-container-orgc75cd66" class="outline-2">
<h2 id="orgc75cd66">Learn to love meetings (Dr. Neil Roodyn)</h2>
<div class="outline-text-2" id="text-orgc75cd66">
<p>
<a href="https://www.youtube.com/watch?v=ppfLUFO-hwc">https://www.youtube.com/watch?v=ppfLUFO-hwc</a>
</p>

<ul class="org-ul">
<li>Have a timeline and an agenda</li>
<li>"Check-in": Say your name, how you feel and your expectations at the beginning
of a meeting</li>
<li>Decisions are made via votes
<ul class="org-ul">
<li>Yes</li>
<li>I don't care</li>
<li>No (you have to provide an alternative to discuss and vote)</li>
</ul></li>
<li>A decision can be postponed through an "investigation". This is used to ask
clarifying questions</li>
<li>They were using a dashboard to display metrics to analyze how the meeting time
was spent (e.g. fiddling with the projector, actual discussions and so on)</li>
<li>Lean Coffee</li>
</ul>
</div>
</div>

<div id="outline-container-orgb28885c" class="outline-2">
<h2 id="orgb28885c">Preventing the Collapse of Civilization (Jonathan Blow)</h2>
<div class="outline-text-2" id="text-orgb28885c">
<p>
<a href="https://www.youtube.com/watch?v=pW-SOdj4Kkk">https://www.youtube.com/watch?v=pW-SOdj4Kkk</a>
</p>

<ul class="org-ul">
<li>Technology on its own will degrade. It needs constant effort to improve and
not lose technology</li>
<li>Without generational transfer, civilizations die</li>
<li>How productive are programming languages at a higher abstraction level (think
C#, Haskell or JavaScript) <b>really</b>? The first version of Unix was written
in three weeks</li>
<li>We keep adding complexity, which means that each individual knows less and
less about a system</li>
<li>We are reducing development time by using existing tools and frameworks, but
we are also giving up capability. This is fine in isolation, but it might
become a problem if everyone does it</li>
<li>Only a handful of people <b>really</b> know how a CPU works</li>
<li>Our tools change our thought process</li>
</ul>
</div>
</div>

<div id="outline-container-orgb8d32f6" class="outline-2">
<h2 id="orgb8d32f6">Don't Walk Away from Complexity, Run (Venkat Subramaniam)</h2>
<div class="outline-text-2" id="text-orgb8d32f6">
<p>
<a href="https://www.youtube.com/watch?v=4MEKu2TcEHM">https://www.youtube.com/watch?v=4MEKu2TcEHM</a>
</p>

<ul class="org-ul">
<li>Two kinds of code frustrate him:
<ul class="org-ul">
<li>One that won't work</li>
<li>One that works, but shouldn't</li>
</ul></li>
<li>Shared mutability is the devil's work</li>
<li>Using a library is like dating, using a framework is like getting married</li>
</ul>
</div>
</div>
