content/notes/software-development.org
* Transactions - Myths, Suprises and Opportunities (Martin Kleppmann)

https://www.youtube.com/watch?v=5ZjhNTM8XU8

ACID is more or less a marketing term, it isn't too precise.

*Durability*

Used to mean that your database is written to an archive tape. When tape bands
fell out of fashion, durability was redefined as "fsync to disk". With the rise
of distributed system, durability was redefined once more to mean replication.

*Consistency*

- This is not the same C as in the CAP theorem
- A database moves from one consistent state to the another through
  transactions. A consistent state is defined through integrity checks or
  invariants (e.g. the balance of an account cannot be negative)
- It is a property of how the application uses the database, it is not a
  property of the database itself

*Atomicity*

- "All or nothing guarantee"
- It's about handling crashes/fault, not about concurrency! You either get all
  or no parts of a transaction

*Isolation*

Serializable isolation means that the effects of concurrent transactions is as
though all transactions were performed in a serial (one after the other)
fashion. Each transaction feels as if it had the whole database for itself.

Databases have different default and maximum isolation levels. These levels are:

- Read Uncommitted
- Read Committed:
  - Dirty reads/writes are not allowed
  - Does not prevent Read Skew (see below). This is scary, as "Read Committed"
    is the default isolation level for several databases
- Snapshot Isolation:
  - Read skews are not allowed. If a transaction is reading the database, the
    transaction sees the database at a specific point in time. Other
    transactions do not interfere.
  - Does not prevent Write Skew
- Repeatable Read
- Serializable
  - Can prevent Write Skew
  - Some implementations use two-phase-locking (not two-phase-commit!), which
    use shared locks. This can be problematic, as analytical queries lock the
    whole databases.
  - Other solutions (which don't use shared locks) are H-Store and Serializable
    Snapshot Isolation

*Race Conditions*

- Dirty Read: A transaction can read what another unfinished transaction wrote
- Dirty Write: Concurrent writes to several tables can interfere with each other
- Read Skew: Imagine a transaction which transfers 100 dollars from one account
  to another. A backup process might read both accounts at different times (one
  before a transaction, and one afterwards), which means that the backup now
  contains inconsistent data
- Write Skew:
  - Pattern: Read something, make decision, write decision to database
  - Example: An ambulance system requires, that each shift has at least one
    doctor on call. If several doctors request to go off call at the same time,
    we can end up in a situation in which no doctor is on call. This can happen
    because these concurrent transactions see the exact same snapshot of a
    database
  - "By the time the write is committed, the premise of the decision is no
    longer true"

* How did we end up here (Todd Montgomery & Martin Thompson)

https://www.youtube.com/watch?v=oxjT7veKi9c

- Focus on the fundamentals. Master them and understand them before you try
  to change them
- Shared mutable state is *a complete nightmare* and should only be used for
  systems programming. The smartest people get this wrong all the time
  - A cache is one the hardest problems in computer science. Do you *really*
    want to implement it yourself?
  - Embrace append-only, single writer, and shared nothing designs
- Universal scalability law: You can't run away from math
- Stop using text encoding. The web is in a constant "debug mode"
- Synchronous communication is the crystal meth of distributed programming.
  Remote Procedure Calls do not work
- Object orientation and set theories are great models. Please don't use ORMs to
  make them work together. If you don't understand SQL, please do not use a
  database
- "The purpose of abstraction is not to be vague, but to create a new semantic
  level in which one can absolutely precise" - Dijkstra
- Think in terms of transformation and flow of data - not code!
- Farley's second law: "As soon as you realize that most people don't know what
  they are doing the world makes a lot more sense"

* It's about time (Christin Gorman)

https://www.youtube.com/watch?v=Nhhm5yC2HCo

The basic time library in your favorite programming language might be horrible.
Why? Because they tend to mix two very different concepts:

- The linear progression of time
- An interpretation of time, based on politics, astronomy and history

What time is it? 1532428776. No, I mean what time is it? Well, that depends.
Which epoch do you mean?

| Environment | Start      |
|-------------+------------|
| .NET        | 1 Jan 0001 |
| Windows     | 1 Jan 1601 |
| Unix        | 1 Jan 1970 |
| GPS         | 5 Jan 1980 |

A timestamp on Windows means something completely different than a timestamp on
Unix!

Time synchronization (clock drift correction) is the reason why Windows does not
guarantee, that the system time increases monotonically. So you shouldn't use
it. Instead, use something different like the current tick count, or use your
own sequence number.

UTC (which stands for Coordinated Universal Time) is an effort to create a
system on which we can all agree.

Coding advice:

- Store timestamps as UTC together with a time zone
- Do not store start/end timestamps. Instead, store a start timestamp together
  with a duration. This makes it much easier to deal with events such as
  day-light saving
- Don't always mock out your database layer. The conversation of dates (which
  can depend on the time zone of your database *and* on the time zone of your
  operating system) will hunt you down
- Make date ranges *inclusive* from and *exclusive* to (start <= value <
  end)

