notes/software-development/index.html

<div id="outline-container-org4073894" class="outline-2">
<h2 id="org4073894">Transactions - Myths, Suprises and Opportunities (Martin Kleppmann)</h2>
<div class="outline-text-2" id="text-org4073894">
<p>
<a href="https://www.youtube.com/watch?v=5ZjhNTM8XU8">https://www.youtube.com/watch?v=5ZjhNTM8XU8</a>
</p>

<p>
ACID is more or less a marketing term, it isn't too precise.
</p>

<p>
<b>Durability</b>
</p>

<p>
Used to mean that your database is written to an archive tape. When tape bands
fell out of fashion, durability was redefined as "fsync to disk". With the rise
of distributed system, durability was redefined once more to mean replication.
</p>

<p>
<b>Consistency</b>
</p>

<ul class="org-ul">
<li>This is not the same C as in the CAP theorem</li>
<li>A database moves from one consistent state to the another through
transactions. A consistent state is defined through integrity checks or
invariants (e.g. the balance of an account cannot be negative)</li>
<li>It is a property of how the application uses the database, it is not a
property of the database itself</li>
</ul>

<p>
<b>Atomicity</b>
</p>

<ul class="org-ul">
<li>"All or nothing guarantee"</li>
<li>It's about handling crashes/fault, not about concurrency! You either get all
or no parts of a transaction</li>
</ul>

<p>
<b>Isolation</b>
</p>

<p>
Serializable isolation means that the effects of concurrent transactions is as
though all transactions were performed in a serial (one after the other)
fashion. Each transaction feels as if it had the whole database for itself.
</p>

<p>
Databases have different default and maximum isolation levels. These levels are:
</p>

<ul class="org-ul">
<li>Read Uncommitted</li>
<li>Read Committed:
<ul class="org-ul">
<li>Dirty reads/writes are not allowed</li>
<li>Does not prevent Read Skew (see below). This is scary, as "Read Committed"
is the default isolation level for several databases</li>
</ul></li>
<li>Snapshot Isolation:
<ul class="org-ul">
<li>Read skews are not allowed. If a transaction is reading the database, the
transaction sees the database at a specific point in time. Other
transactions do not interfere.</li>
<li>Does not prevent Write Skew</li>
</ul></li>
<li>Repeatable Read</li>
<li>Serializable
<ul class="org-ul">
<li>Can prevent Write Skew</li>
<li>Some implementations use two-phase-locking (not two-phase-commit!), which
use shared locks. This can be problematic, as analytical queries lock the
whole databases.</li>
<li>Other solutions (which don't use shared locks) are H-Store and Serializable
Snapshot Isolation</li>
</ul></li>
</ul>

<p>
<b>Race Conditions</b>
</p>

<ul class="org-ul">
<li>Dirty Read: A transaction can read what another unfinished transaction wrote</li>
<li>Dirty Write: Concurrent writes to several tables can interfere with each other</li>
<li>Read Skew: Imagine a transaction which transfers 100 dollars from one account
to another. A backup process might read both accounts at different times (one
before a transaction, and one afterwards), which means that the backup now
contains inconsistent data</li>
<li>Write Skew:
<ul class="org-ul">
<li>Pattern: Read something, make decision, write decision to database</li>
<li>Example: An ambulance system requires, that each shift has at least one
doctor on call. If several doctors request to go off call at the same time,
we can end up in a situation in which no doctor is on call. This can happen
because these concurrent transactions see the exact same snapshot of a
database</li>
<li>"By the time the write is committed, the premise of the decision is no
longer true"</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org1114001" class="outline-2">
<h2 id="org1114001">How did we end up here (Todd Montgomery &amp; Martin Thompson)</h2>
<div class="outline-text-2" id="text-org1114001">
<p>
<a href="https://www.youtube.com/watch?v=oxjT7veKi9c">https://www.youtube.com/watch?v=oxjT7veKi9c</a>
</p>

<ul class="org-ul">
<li>Focus on the fundamentals. Master them and understand them before you try
to change them</li>
<li>Shared mutable state is <b>a complete nightmare</b> and should only be used for
systems programming. The smartest people get this wrong all the time
<ul class="org-ul">
<li>A cache is one the hardest problems in computer science. Do you <b>really</b>
want to implement it yourself?</li>
<li>Embrace append-only, single writer, and shared nothing designs</li>
</ul></li>
<li>Universal scalability law: You can't run away from math</li>
<li>Stop using text encoding. The web is in a constant "debug mode"</li>
<li>Synchronous communication is the crystal meth of distributed programming.
Remote Procedure Calls do not work</li>
<li>Object orientation and set theories are great models. Please don't use ORMs to
make them work together. If you don't understand SQL, please do not use a
database</li>
<li>"The purpose of abstraction is not to be vague, but to create a new semantic
level in which one can absolutely precise" - Dijkstra</li>
<li>Think in terms of transformation and flow of data - not code!</li>
<li>Farley's second law: "As soon as you realize that most people don't know what
they are doing the world makes a lot more sense"</li>
</ul>
</div>
</div>

<div id="outline-container-org57cacb0" class="outline-2">
<h2 id="org57cacb0">It's about time (Christin Gorman)</h2>
<div class="outline-text-2" id="text-org57cacb0">
<p>
<a href="https://www.youtube.com/watch?v=Nhhm5yC2HCo">https://www.youtube.com/watch?v=Nhhm5yC2HCo</a>
</p>

<p>
The basic time library in your favorite programming language might be horrible.
Why? Because they tend to mix two very different concepts:
</p>

<ul class="org-ul">
<li>The linear progression of time</li>
<li>An interpretation of time, based on politics, astronomy and history</li>
</ul>

<p>
What time is it? 1532428776. No, I mean what time is it? Well, that depends.
Which epoch do you mean?
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Environment</th>
<th scope="col" class="org-left">Start</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">.NET</td>
<td class="org-left">1 Jan 0001</td>
</tr>

<tr>
<td class="org-left">Windows</td>
<td class="org-left">1 Jan 1601</td>
</tr>

<tr>
<td class="org-left">Unix</td>
<td class="org-left">1 Jan 1970</td>
</tr>

<tr>
<td class="org-left">GPS</td>
<td class="org-left">5 Jan 1980</td>
</tr>
</tbody>
</table>

<p>
A timestamp on Windows means something completely different than a timestamp on
Unix!
</p>

<p>
Time synchronization (clock drift correction) is the reason why Windows does not
guarantee, that the system time increases monotonically. So you shouldn't use
it. Instead, use something different like the current tick count, or use your
own sequence number.
</p>

<p>
UTC (which stands for Coordinated Universal Time) is an effort to create a
system on which we can all agree.
</p>

<p>
Coding advice:
</p>

<ul class="org-ul">
<li>Store timestamps as UTC together with a time zone</li>
<li>Do not store start/end timestamps. Instead, store a start timestamp together
with a duration. This makes it much easier to deal with events such as
day-light saving</li>
<li>Don't always mock out your database layer. The conversation of dates (which
can depend on the time zone of your database <b>and</b> on the time zone of your
operating system) will hunt you down</li>
<li>Make date ranges <b>inclusive</b> from and <b>exclusive</b> to (start &lt;= value &lt;
end)</li>
</ul>
</div>
</div>
