content/notes/software-development.org
* PID Loops and the Art of Keeping Systems Stable (Colm MacCárthaigh)

https://www.youtube.com/watch?v=3AxSwCC7I4s

Control theory:

Present -> Observe -> Feedback -> React -> (Present)

A furnace is a classical example of applied control theory: you want to keep
water at a specific temperature. So what do you do? You measure the error (e.g.
the water has 20°C, it should be 100°C, so the error is 80°C) and react with
correcting actions based on the error. To do this, we distinguish three types of
controllers:

*P Controller*

- Takes proportional steps to correct an error (e.g. the applied heat is
  proportional to the measured error)
- These systems tend to oscillate around the desired state

*PI Controller*

- Adds an integral to observe an error over time
- Such a system still oscillates, but the overall error curve is flattened
- Thermostats or cruise controls use PI systems
- These systems cannot deal with shocks

*PID Controller*

- Adds a derivative component to predict future errors

*Anti Patterns*

Using open loops is scary. The system cannot detect a problem. Chaos engineering
and observability are fine practices to find open loops. Open loop systems tend
to be imperative (do this, do that), while closed loop system tend to be
declarative (please get the system into my defined desired state).

Power laws are out to get you. A system failure can spread in an exponential
way. These failures can be kept in their cages by building smaller systems
(which decrease the overall "blasting radius"). Other techniques include:

- Exponential back-off
- Rate-limiters

Sudden load spikes can bring down a system. In general: keep your queues short.
LIFO queues might be a good idea, as they will prioritize new information.

Implementing edge triggered systems imply, that you have solved the "deliver
just once" problem. Level triggered (and idempotent) systems seem to be a
simpler solution.

* Big Numbers and the 1Hz CPU (Tom Hudson)

https://www.youtube.com/watch?v=pDBOC6I3K8g

We do not have a good intuition for how fast different parts of a computer are.

Let's have a look at a 3ghz CPU and different access times:

- Register: 0.3ns
- L1 cache: 1.5ns
- L2 cache: 3ns
- L3 cache 13ns
- RAM: 0.1 microseconds
- HDD: 6ms
- SSD: 80 microseconds

All these values seem "low enough", but let's but them into perspective using a
1 Hertz CPU:

- Register: 1 second
- L1 cache: 4.5 seconds
- L2 cache: 9 seconds
- L3 cache: 39 seconds
- RAM: 5 minutes
- HDD: 9 months
- SSD: 1 day

* Design, Composition, and Performance (Rich Hickey)

https://www.youtube.com/watch?v=MCZ3YgeEUPg

- Design is taking things apart so you can put them back together
- An instrument is a tool for an expert
- You learn an instrument by playing the actual instrument. There is no real
  alternative. This means, that you are using an experts tool while being a
  novice. But you won't be a novice for long
- An instrument is (for the most part) very simple. It is made to work in a very
  specific way. Composers can use several instruments to create a predictable
  outcome. This would be hard if instruments weren't that limited
- A musician spends most of his time practicing instead of performing. Why is
  our industry different?
- We should build interfaces for machines first and then put an interface for a
  human on top
- Constraint is a driver for creativity
- Design is making decisions. It's about saying no

* Thinking Fast and Slow (Linda Rising)

https://www.youtube.com/watch?v=XjbTLIqnq-o

*System 1*

- Unconscious (runs 24/7)
- Fast, intuitive
- Can multi-task
- ~11 million bits/second
- 95% of cognitive function
- inaccessible

*System 2*

- Conscious
- Slow, rational, forgetful
- Linear (Cannot multi-task)
- ~40 bits/second
- 5% of cognitive function

We identify with System 2 and we believe, that System 2 is in charge.

System 1 gains its speed by using heuristics. It is also in charge of "telling
our story" in which we are identified as the hero. System 1 is prone to biases
such as:

- *Confirmation bias:* We seek confirmation instead of information. We like to
  stick to our point of view, even in the face of evidence which supports a
  different point
- *Cognitive dissonance:* We have a hard time to keep two contradicting ideas
  in our head
- *Naive realism:* We believe that we are rational and that a disagreeing part
  will "see" if we present them "our facts"

We overestimate our own understanding and underestimate the role of randomness
in our world. We seek for patterns and explanations, even if there aren't any.

System 2 can only focus for about 50 minutes (max) before taking a break.

We use System 2 to learn something new. Over time, a certain skill moves to
System 1 (e.g. walking, driving, or playing an instrument). After is has moved
to System 1, interference from System 2 can hurt our performance by
"overthinking".

System 2 takes a lot of energy. Self control causes a drop in your blood
glucose. We have a limited pool of "mental energy". This is why we tend to make
worse decisions when tired or hungry.

System 2 believes that it runs the show, but System 1 is in charge! And that's
good. You don't want to trust a system which lets you forget your keys to care
about essential tasks such as breathing.

*Better Meetings*

- Water, tea, coffee available
- Standing should be OK
- Very small groups
- Limit meeting times to ~40 minutes. For longer meetings, take a different seat
  after a break
- 10 minute break before important decisions

* Mistakes and Discoveries While Cultivating Ownership (Aaron Blohowiak)

https://www.youtube.com/watch?v=ddOGmao_cnA

*Netflix Culture*

- *Avoid rules:* Do not constraint people. We need good judgment
- *People over Process:* The world is changing, while your process is lacking
  behind
- *Context not Control:* You can't really good decisions if you do not
  understand your environment. A manager knows less than the "people in the
  field"
- *Freedom and Responsibility:* Have options and hold people responsible for
  the quality of their decision making

*Levels of Ownership*

0. *Demonstration:* No ownership
1. *Oversight:* You do it, but we will pre-approve it
2. *Observation:* You do it and we will review it after it is done
3. *Execution:* Here's where we want to go and we know that you will pull it
   off. We might check just so that we know what's going on
4. *Vision:* You understand your responsibilities and your shareholder's needs

*Mistakes*

- Different ideas about which level we should be at
- Not being explicit when levels change

