notes/software-development/index.html

<div id="outline-container-org6bc5a37" class="outline-2">
<h2 id="org6bc5a37">PID Loops and the Art of Keeping Systems Stable (Colm MacCárthaigh)</h2>
<div class="outline-text-2" id="text-org6bc5a37">
<p>
<a href="https://www.youtube.com/watch?v=3AxSwCC7I4s">https://www.youtube.com/watch?v=3AxSwCC7I4s</a>
</p>

<p>
Control theory:
</p>

<p>
Present -&gt; Observe -&gt; Feedback -&gt; React -&gt; (Present)
</p>

<p>
A furnace is a classical example of applied control theory: you want to keep
water at a specific temperature. So what do you do? You measure the error (e.g.
the water has 20°C, it should be 100°C, so the error is 80°C) and react with
correcting actions based on the error. To do this, we distinguish three types of
controllers:
</p>

<p>
<b>P Controller</b>
</p>

<ul class="org-ul">
<li>Takes proportional steps to correct an error (e.g. the applied heat is
proportional to the measured error)</li>
<li>These systems tend to oscillate around the desired state</li>
</ul>

<p>
<b>PI Controller</b>
</p>

<ul class="org-ul">
<li>Adds an integral to observe an error over time</li>
<li>Such a system still oscillates, but the overall error curve is flattened</li>
<li>Thermostats or cruise controls use PI systems</li>
<li>These systems cannot deal with shocks</li>
</ul>

<p>
<b>PID Controller</b>
</p>

<ul class="org-ul">
<li>Adds a derivative component to predict future errors</li>
</ul>

<p>
<b>Anti Patterns</b>
</p>

<p>
Using open loops is scary. The system cannot detect a problem. Chaos engineering
and observability are fine practices to find open loops. Open loop systems tend
to be imperative (do this, do that), while closed loop system tend to be
declarative (please get the system into my defined desired state).
</p>

<p>
Power laws are out to get you. A system failure can spread in an exponential
way. These failures can be kept in their cages by building smaller systems
(which decrease the overall "blasting radius"). Other techniques include:
</p>

<ul class="org-ul">
<li>Exponential back-off</li>
<li>Rate-limiters</li>
</ul>

<p>
Sudden load spikes can bring down a system. In general: keep your queues short.
LIFO queues might be a good idea, as they will prioritize new information.
</p>

<p>
Implementing edge triggered systems imply, that you have solved the "deliver
just once" problem. Level triggered (and idempotent) systems seem to be a
simpler solution.
</p>
</div>
</div>

<div id="outline-container-orgb58a4ad" class="outline-2">
<h2 id="orgb58a4ad">Big Numbers and the 1Hz CPU (Tom Hudson)</h2>
<div class="outline-text-2" id="text-orgb58a4ad">
<p>
<a href="https://www.youtube.com/watch?v=pDBOC6I3K8g">https://www.youtube.com/watch?v=pDBOC6I3K8g</a>
</p>

<p>
We do not have a good intuition for how fast different parts of a computer are.
</p>

<p>
Let's have a look at a 3ghz CPU and different access times:
</p>

<ul class="org-ul">
<li>Register: 0.3ns</li>
<li>L1 cache: 1.5ns</li>
<li>L2 cache: 3ns</li>
<li>L3 cache 13ns</li>
<li>RAM: 0.1 microseconds</li>
<li>HDD: 6ms</li>
<li>SSD: 80 microseconds</li>
</ul>

<p>
All these values seem "low enough", but let's but them into perspective using a
1 Hertz CPU:
</p>

<ul class="org-ul">
<li>Register: 1 second</li>
<li>L1 cache: 4.5 seconds</li>
<li>L2 cache: 9 seconds</li>
<li>L3 cache: 39 seconds</li>
<li>RAM: 5 minutes</li>
<li>HDD: 9 months</li>
<li>SSD: 1 day</li>
</ul>
</div>
</div>

<div id="outline-container-orgeb8029a" class="outline-2">
<h2 id="orgeb8029a">Design, Composition, and Performance (Rich Hickey)</h2>
<div class="outline-text-2" id="text-orgeb8029a">
<p>
<a href="https://www.youtube.com/watch?v=MCZ3YgeEUPg">https://www.youtube.com/watch?v=MCZ3YgeEUPg</a>
</p>

<ul class="org-ul">
<li>Design is taking things apart so you can put them back together</li>
<li>An instrument is a tool for an expert</li>
<li>You learn an instrument by playing the actual instrument. There is no real
alternative. This means, that you are using an experts tool while being a
novice. But you won't be a novice for long</li>
<li>An instrument is (for the most part) very simple. It is made to work in a very
specific way. Composers can use several instruments to create a predictable
outcome. This would be hard if instruments weren't that limited</li>
<li>A musician spends most of his time practicing instead of performing. Why is
our industry different?</li>
<li>We should build interfaces for machines first and then put an interface for a
human on top</li>
<li>Constraint is a driver for creativity</li>
<li>Design is making decisions. It's about saying no</li>
</ul>
</div>
</div>

<div id="outline-container-orgf47c03d" class="outline-2">
<h2 id="orgf47c03d">Thinking Fast and Slow (Linda Rising)</h2>
<div class="outline-text-2" id="text-orgf47c03d">
<p>
<a href="https://www.youtube.com/watch?v=XjbTLIqnq-o">https://www.youtube.com/watch?v=XjbTLIqnq-o</a>
</p>

<p>
<b>System 1</b>
</p>

<ul class="org-ul">
<li>Unconscious (runs 24/7)</li>
<li>Fast, intuitive</li>
<li>Can multi-task</li>
<li>~11 million bits/second</li>
<li>95% of cognitive function</li>
<li>inaccessible</li>
</ul>

<p>
<b>System 2</b>
</p>

<ul class="org-ul">
<li>Conscious</li>
<li>Slow, rational, forgetful</li>
<li>Linear (Cannot multi-task)</li>
<li>~40 bits/second</li>
<li>5% of cognitive function</li>
</ul>

<p>
We identify with System 2 and we believe, that System 2 is in charge.
</p>

<p>
System 1 gains its speed by using heuristics. It is also in charge of "telling
our story" in which we are identified as the hero. System 1 is prone to biases
such as:
</p>

<ul class="org-ul">
<li><b>Confirmation bias:</b> We seek confirmation instead of information. We like to
stick to our point of view, even in the face of evidence which supports a
different point</li>
<li><b>Cognitive dissonance:</b> We have a hard time to keep two contradicting ideas
in our head</li>
<li><b>Naive realism:</b> We believe that we are rational and that a disagreeing part
will "see" if we present them "our facts"</li>
</ul>

<p>
We overestimate our own understanding and underestimate the role of randomness
in our world. We seek for patterns and explanations, even if there aren't any.
</p>

<p>
System 2 can only focus for about 50 minutes (max) before taking a break.
</p>

<p>
We use System 2 to learn something new. Over time, a certain skill moves to
System 1 (e.g. walking, driving, or playing an instrument). After is has moved
to System 1, interference from System 2 can hurt our performance by
"overthinking".
</p>

<p>
System 2 takes a lot of energy. Self control causes a drop in your blood
glucose. We have a limited pool of "mental energy". This is why we tend to make
worse decisions when tired or hungry.
</p>

<p>
System 2 believes that it runs the show, but System 1 is in charge! And that's
good. You don't want to trust a system which lets you forget your keys to care
about essential tasks such as breathing.
</p>

<p>
<b>Better Meetings</b>
</p>

<ul class="org-ul">
<li>Water, tea, coffee available</li>
<li>Standing should be OK</li>
<li>Very small groups</li>
<li>Limit meeting times to ~40 minutes. For longer meetings, take a different seat
after a break</li>
<li>10 minute break before important decisions</li>
</ul>
</div>
</div>

<div id="outline-container-org7f892fa" class="outline-2">
<h2 id="org7f892fa">Mistakes and Discoveries While Cultivating Ownership (Aaron Blohowiak)</h2>
<div class="outline-text-2" id="text-org7f892fa">
<p>
<a href="https://www.youtube.com/watch?v=ddOGmao_cnA">https://www.youtube.com/watch?v=ddOGmao_cnA</a>
</p>

<p>
<b>Netflix Culture</b>
</p>

<ul class="org-ul">
<li><b>Avoid rules:</b> Do not constraint people. We need good judgment</li>
<li><b>People over Process:</b> The world is changing, while your process is lacking
behind</li>
<li><b>Context not Control:</b> You can't really good decisions if you do not
understand your environment. A manager knows less than the "people in the
field"</li>
<li><b>Freedom and Responsibility:</b> Have options and hold people responsible for
the quality of their decision making</li>
</ul>

<p>
<b>Levels of Ownership</b>
</p>

<ol class="org-ol">
<li><b>Demonstration:</b> No ownership</li>
<li><b>Oversight:</b> You do it, but we will pre-approve it</li>
<li><b>Observation:</b> You do it and we will review it after it is done</li>
<li><b>Execution:</b> Here's where we want to go and we know that you will pull it
off. We might check just so that we know what's going on</li>
<li><b>Vision:</b> You understand your responsibilities and your shareholder's needs</li>
</ol>

<p>
<b>Mistakes</b>
</p>

<ul class="org-ul">
<li>Different ideas about which level we should be at</li>
<li>Not being explicit when levels change</li>
</ul>
</div>
</div>
