content/notes/software-development.org
* Changing your Habits & Environment to get more Professional Productivity (Linda Rising)

https://www.youtube.com/watch?v=mrHjHdyRDNY

- We sit too much and move too little
- Lying down can improve your problem solving skills
- Try to have meetings while walking

* Functional data that adapts to change (Don Syme)

https://www.youtube.com/watch?v=us4dp7Ksly0

- Classic UIs are built using the MVVM pattern
- A different approach to building UI is called MVU: Model, View, Update
  - Examples: Svelte, Elm, React Native
- MVU is based on functional principles
- There is a unidirectional data flow
- "UI becomes calculation and information, not state"
- We create a view based on a model and update the model through messages, which
  in turn changes the view
- An initial reaction might be that "functional" and "high performance" cannot
  go together. The key to making it work is "incremental functional
  programming", which is related to event sourcing

* A Cheap Effective Method for Dealing with Stressful Situations (Linda Rising)

https://www.youtube.com/watch?v=ODpq_6qcPIA

- The pandemic has created a very stressful environment
- Long periods of anxiety compromises our immune system
- What doesn't work:
  - Suppressing/denying a stressful situation
  - Positive thinking (not strong enough)
  - Distractions
  - Venting
  - Blaming others/circumstances
- What does work: expressive writing. Write about your troubles
- General instructions
  - Write 15-20 min/day for 4-5 consecutive days
  - Topic should be personal and important
  - Write continuously. Don't worry about punctuation, spelling, grammar. If you
    run out of things to say, repeat what you have written. Keep pen on paper.
  - Write only for yourself. Destroy or hide what you are writing. Do not turn
    the exercise into a letter. The result is for your eyes only.
  - If you feel you cannot write about something because it will push you over
    the edge, STOP!
  - Some feel sad after writing, especially on the first day. This feeling
    usually goes away in an hour or so
- *Pen and paper work best*, but typing or voice recording are OK
- Writing before stressful situations (e.g. test taking, presentations, surgery,
  ...) can also be beneficial

* If (domain logic) then CQRS, or Saga (Udi Dahan)

https://www.youtube.com/watch?v=fWU8ZK0Dmxs

- Hard deletes are painful as they can lead to cascading deletes (e.g. deleting
  a product may delete user purchases)
- We use soft deletes as a "quick fix" to the cascading delete problem
- But deleting makes a lot of sense in a "private domain", e.g. when a user
  updates the product catalog. We can treat this domain as a sandbox, where the
  user can manipulate data in an easy way
- We need to validate data when we are publishing it from the "private domain"
  to a "public domain" (e.g. so that the customer can see the updated product
  catalog)
- Deletes in a "public domain" hide business intent. Why do you want to delete
  data? Do you really want to delete this product, or do intent to no longer
  sell this product?
- Systems like Amazon are a collaborative domain. Checking invariants is doomed
  to be full of race conditions. Example: A user adds a product to his shopping
  cart. An employee marks the same product as "not for sale". Depending on the
  timing of these requests, an invariance such as "a user cannot buy an item if
  it is not for sale" cannot hold.
- We need to deal with eventual consistency in the context of the business.
  Don't confuse this with technical eventual consistency (e.g. updating read
  models)

* Cultivating Architecture (Martin Fowler, Birgitta Böckeler)

https://www.youtube.com/watch?v=MZnrxjw602E

- Good architecture can accelerate a team as it can keep the cost of change down
- Software delivery performance correlates with organizational performance
- Strive to create autonomous teams
- Inform technical staff about the business goals
- Create a set of guiding principles which should help a team when dealing with
  architecture decisions
  - Find principles by identifying what's moving you forward and what's holding
    you back
- Create your own tech radar. What technology do we use? What do we want to try?
  What do we want to get rid of?
- Document any decisions. A simple markdown file might be enough

* What I learned from three years of sciencing the crap out of DevOps (Jez Humble)

https://www.youtube.com/watch?v=kr08zSnyU20

- Job satisfaction is the biggest indicator for organization performance
- IT companies with high throughput perform better in terms of stability

* Files (Dan Luu)

https://www.deconstructconf.com/2019/dan-luu-files

- We believe that file systems are a solved problem and that they share a common
  abstraction, but that is not true
- Writing a file may seem easy, but there's a lot that could go wrong. File
  systems have bugs too
- File operations may not be atomic
- Even great programmers make mistakes when using the file system. Static
  analysis tools found bugs when inspecting code bases such as Git, Postgres
- Sqlite is a rather stable way to interact with the file system
- Different file systems have different behavior when dealing with errors
- SSDs need ECC (error correcting codes) not be "better", but rather to work at
  all
- Computers don't work

* Optimize For Time (Andy Walker)

https://www.youtube.com/watch?v=fBr8BKPW5tc

- High performing teams seem to have more time to get things done. They don't
  hurry. They hit their deadlines
- Struggling teams seem to always be behind
- Busyness is a curse
- Four things he holds true
  - Invest in improvement
  - Respect each other's time
  - Ruthless about time (say no to things that don't make sense)
  - Anticipate problems
- What if the team is the product? If you are not investing in moving faster
  you're moving slower
- Only interrupt people if there is an important reason to do so
- Teams that invest in each other achieve more
- Change is expensive! Fail fast
- When given a hard deadline, work from the basis that everything is going to
  failure
  - Plan for failure
  - Plan to fail cheaply
  - Your plan is not the outcome
  - Recover quickly

