notes/software-development/index.html

<div id="outline-container-org1a3edd9" class="outline-2">
<h2 id="org1a3edd9">Changing your Habits &amp; Environment to get more Professional Productivity (Linda Rising)</h2>
<div class="outline-text-2" id="text-org1a3edd9">
<p>
<a href="https://www.youtube.com/watch?v=mrHjHdyRDNY">https://www.youtube.com/watch?v=mrHjHdyRDNY</a>
</p>

<ul class="org-ul">
<li>We sit too much and move too little</li>
<li>Lying down can improve your problem solving skills</li>
<li>Try to have meetings while walking</li>
</ul>
</div>
</div>

<div id="outline-container-orgcd88272" class="outline-2">
<h2 id="orgcd88272">Functional data that adapts to change (Don Syme)</h2>
<div class="outline-text-2" id="text-orgcd88272">
<p>
<a href="https://www.youtube.com/watch?v=us4dp7Ksly0">https://www.youtube.com/watch?v=us4dp7Ksly0</a>
</p>

<ul class="org-ul">
<li>Classic UIs are built using the MVVM pattern</li>
<li>A different approach to building UI is called MVU: Model, View, Update
<ul class="org-ul">
<li>Examples: Svelte, Elm, React Native</li>
</ul></li>
<li>MVU is based on functional principles</li>
<li>There is a unidirectional data flow</li>
<li>"UI becomes calculation and information, not state"</li>
<li>We create a view based on a model and update the model through messages, which
in turn changes the view</li>
<li>An initial reaction might be that "functional" and "high performance" cannot
go together. The key to making it work is "incremental functional
programming", which is related to event sourcing</li>
</ul>
</div>
</div>

<div id="outline-container-org95036cd" class="outline-2">
<h2 id="org95036cd">A Cheap Effective Method for Dealing with Stressful Situations (Linda Rising)</h2>
<div class="outline-text-2" id="text-org95036cd">
<p>
<a href="https://www.youtube.com/watch?v=ODpq_6qcPIA">https://www.youtube.com/watch?v=ODpq_6qcPIA</a>
</p>

<ul class="org-ul">
<li>The pandemic has created a very stressful environment</li>
<li>Long periods of anxiety compromises our immune system</li>
<li>What doesn't work:
<ul class="org-ul">
<li>Suppressing/denying a stressful situation</li>
<li>Positive thinking (not strong enough)</li>
<li>Distractions</li>
<li>Venting</li>
<li>Blaming others/circumstances</li>
</ul></li>
<li>What does work: expressive writing. Write about your troubles</li>
<li>General instructions
<ul class="org-ul">
<li>Write 15-20 min/day for 4-5 consecutive days</li>
<li>Topic should be personal and important</li>
<li>Write continuously. Don't worry about punctuation, spelling, grammar. If you
run out of things to say, repeat what you have written. Keep pen on paper.</li>
<li>Write only for yourself. Destroy or hide what you are writing. Do not turn
the exercise into a letter. The result is for your eyes only.</li>
<li>If you feel you cannot write about something because it will push you over
the edge, STOP!</li>
<li>Some feel sad after writing, especially on the first day. This feeling
usually goes away in an hour or so</li>
</ul></li>
<li><b>Pen and paper work best</b>, but typing or voice recording are OK</li>
<li>Writing before stressful situations (e.g. test taking, presentations, surgery,
&#x2026;) can also be beneficial</li>
</ul>
</div>
</div>

<div id="outline-container-org65f1c59" class="outline-2">
<h2 id="org65f1c59">If (domain logic) then CQRS, or Saga (Udi Dahan)</h2>
<div class="outline-text-2" id="text-org65f1c59">
<p>
<a href="https://www.youtube.com/watch?v=fWU8ZK0Dmxs">https://www.youtube.com/watch?v=fWU8ZK0Dmxs</a>
</p>

<ul class="org-ul">
<li>Hard deletes are painful as they can lead to cascading deletes (e.g. deleting
a product may delete user purchases)</li>
<li>We use soft deletes as a "quick fix" to the cascading delete problem</li>
<li>But deleting makes a lot of sense in a "private domain", e.g. when a user
updates the product catalog. We can treat this domain as a sandbox, where the
user can manipulate data in an easy way</li>
<li>We need to validate data when we are publishing it from the "private domain"
to a "public domain" (e.g. so that the customer can see the updated product
catalog)</li>
<li>Deletes in a "public domain" hide business intent. Why do you want to delete
data? Do you really want to delete this product, or do intent to no longer
sell this product?</li>
<li>Systems like Amazon are a collaborative domain. Checking invariants is doomed
to be full of race conditions. Example: A user adds a product to his shopping
cart. An employee marks the same product as "not for sale". Depending on the
timing of these requests, an invariance such as "a user cannot buy an item if
it is not for sale" cannot hold.</li>
<li>We need to deal with eventual consistency in the context of the business.
Don't confuse this with technical eventual consistency (e.g. updating read
models)</li>
</ul>
</div>
</div>

<div id="outline-container-org6f87eb2" class="outline-2">
<h2 id="org6f87eb2">Cultivating Architecture (Martin Fowler, Birgitta Böckeler)</h2>
<div class="outline-text-2" id="text-org6f87eb2">
<p>
<a href="https://www.youtube.com/watch?v=MZnrxjw602E">https://www.youtube.com/watch?v=MZnrxjw602E</a>
</p>

<ul class="org-ul">
<li>Good architecture can accelerate a team as it can keep the cost of change down</li>
<li>Software delivery performance correlates with organizational performance</li>
<li>Strive to create autonomous teams</li>
<li>Inform technical staff about the business goals</li>
<li>Create a set of guiding principles which should help a team when dealing with
architecture decisions
<ul class="org-ul">
<li>Find principles by identifying what's moving you forward and what's holding
you back</li>
</ul></li>
<li>Create your own tech radar. What technology do we use? What do we want to try?
What do we want to get rid of?</li>
<li>Document any decisions. A simple markdown file might be enough</li>
</ul>
</div>
</div>

<div id="outline-container-orgc27c58e" class="outline-2">
<h2 id="orgc27c58e">What I learned from three years of sciencing the crap out of DevOps (Jez Humble)</h2>
<div class="outline-text-2" id="text-orgc27c58e">
<p>
<a href="https://www.youtube.com/watch?v=kr08zSnyU20">https://www.youtube.com/watch?v=kr08zSnyU20</a>
</p>

<ul class="org-ul">
<li>Job satisfaction is the biggest indicator for organization performance</li>
<li>IT companies with high throughput perform better in terms of stability</li>
</ul>
</div>
</div>

<div id="outline-container-orgcbc5e50" class="outline-2">
<h2 id="orgcbc5e50">Files (Dan Luu)</h2>
<div class="outline-text-2" id="text-orgcbc5e50">
<p>
<a href="https://www.deconstructconf.com/2019/dan-luu-files">https://www.deconstructconf.com/2019/dan-luu-files</a>
</p>

<ul class="org-ul">
<li>We believe that file systems are a solved problem and that they share a common
abstraction, but that is not true</li>
<li>Writing a file may seem easy, but there's a lot that could go wrong. File
systems have bugs too</li>
<li>File operations may not be atomic</li>
<li>Even great programmers make mistakes when using the file system. Static
analysis tools found bugs when inspecting code bases such as Git, Postgres</li>
<li>Sqlite is a rather stable way to interact with the file system</li>
<li>Different file systems have different behavior when dealing with errors</li>
<li>SSDs need ECC (error correcting codes) not be "better", but rather to work at
all</li>
<li>Computers don't work</li>
</ul>
</div>
</div>

<div id="outline-container-org1a0c4e7" class="outline-2">
<h2 id="org1a0c4e7">Optimize For Time (Andy Walker)</h2>
<div class="outline-text-2" id="text-org1a0c4e7">
<p>
<a href="https://www.youtube.com/watch?v=fBr8BKPW5tc">https://www.youtube.com/watch?v=fBr8BKPW5tc</a>
</p>

<ul class="org-ul">
<li>High performing teams seem to have more time to get things done. They don't
hurry. They hit their deadlines</li>
<li>Struggling teams seem to always be behind</li>
<li>Busyness is a curse</li>
<li>Four things he holds true
<ul class="org-ul">
<li>Invest in improvement</li>
<li>Respect each other's time</li>
<li>Ruthless about time (say no to things that don't make sense)</li>
<li>Anticipate problems</li>
</ul></li>
<li>What if the team is the product? If you are not investing in moving faster
you're moving slower</li>
<li>Only interrupt people if there is an important reason to do so</li>
<li>Teams that invest in each other achieve more</li>
<li>Change is expensive! Fail fast</li>
<li>When given a hard deadline, work from the basis that everything is going to
failure
<ul class="org-ul">
<li>Plan for failure</li>
<li>Plan to fail cheaply</li>
<li>Your plan is not the outcome</li>
<li>Recover quickly</li>
</ul></li>
</ul>
</div>
</div>
