content/notes/software-development.org
* Conversational Transformation (Jeffrey Fredrick, Douglas Squirrel)

https://www.youtube.com/watch?v=RMT_Tqzf_vc

Conversational Analysis with The 4 Rs

- Record
  - Fold a piece of paper in half. Write the major points of your conversation
    on the right hand side. Record what you thought (but didn't say) on the left
    hand side
- Reflect
  - How many genuine questions were asked?
  - What is on the left side that isn't on the right?
  - What sets off negative reactions for you?
- Revise
- Roleplay
- (Repeat)
- (Role-reversal)

* Continuous Retrospectives (Linda Rising)

https://www.youtube.com/watch?v=1wzedZcSmKY

- In times like COVID we cannot even remember what day it is. How can we then
  have a meaningful discussion (retrospective) about a long project?
- Continuous retrospectives: Hang up a timeline and add sticky notes through out
  the day. Capture ideas, questions, concerns, events, problems, success,
  failure
- Spend the last 15 minutes writing about, reflecting on lessons learned that
  day
- Guide Boards
  - https://www.youtube.com/watch?v=DnZnb22Cgd8
  - https://mattischneider.fr/agile/guide-board/paper.pdf
  - https://mattischneider.fr/anthropologie/agile/thesis
- Retrospectives offer different opportunities:
  - Project: long term learning (strategic)
  - Iteration: what should we do now? (tactical)
  - Continuous: small experiments

* Solving Problems the Clojure Way (Rafal Dittwald)

https://www.youtube.com/watch?v=vK1DazRK_a0

- Imperative code spreads state, mutation and side effects, which makes larger
  programs harder to understand and change
- Object oriented programming tries to solve these problems through classes and
  encapsulation. The preferred thinking model revolves around agents and how
  they communicate with each other
- While we cannot get rid of state, functional programming uses a set of
  techniques to avoid state wherever possible. Rafal outlines a few techniques:
  - *Minimize* state
      - Derive state from other state (e.g. the current player of a Tic Tac Toe
        game can be derived based on the board state)
      - Use immutable data structures instead of mutation
      - Pass lambdas
      - Recursion
  - *Concentrate* state into fewer places
  - *Defer* actions (e.g. Elm architecture)
- Given a graph of components, the typical OO approach is to keep state
  separated by pushing it down as far as we can. The FP approach would be to put
  all the state into the root node

* Persistent Data Structures and Managed References (Rich Hickey)

https://www.infoq.com/presentations/Value-Identity-State-Rich-Hickey/

- Pure functions have no notion of time and no effect on the world
- Concurrency breaks variables badly
  - Might not be atomic (e.g. long)
  - Need locks or volatile keywords
- Identity: An entity we associate with a series of relates values over time
  - Can be a composite (e.g. the members of a sports team might change, but we
    still consider it to be the same sports team)
- State: Value of an identity at a time
- Value: An immutable structure (e.g. numbers, strings, ...)
- Overall philosophy
  - Things don't change in place
  - See time as a dimension
  - The future is a function of the past (and doesn't change it)
  - Co-located entities can observe each other without cooperation

* End to end functional tests that can run in milliseconds (Nat Pryce)

https://www.youtube.com/watch?v=Fk4rCn4YLLU

- They applied the hexagonal architecture model in combination with
  "screenplays"
- Tests can run in different scenarios (in memory, using a Browser with or
  without JS, REST calls, ...)
- They put all interactions (e.g. steps a user takes to update his mail address)
  behind an interface, so that these "use cases" don't know anything about a
  scenario. This technique allows the team to change an N*M mapping to an N+M
  mapping
- Gives great feedback about the actual state of the system. Such an approach
  can find problems in your CDN configuration or your caching policies
- Makes the overall system more observable
- To test/maintain a system we need to
  - Know what the system is doing
  - Know when it has stopped doing it
  - Know when the system has failed
  - Explain what has gone wrong
  - Restore the system to a good state

* Design Microservice Architectures the Right Way (Michael Bryzek)

https://www.youtube.com/watch?v=j6ow-UemzBc

- Describe APIs/Events/Databases (e.g. by using JSON) and invest in tooling
  - Create custom linters to ensure that common naming conventions are used
  - Use code generation to automate API creation using CI/CD
  - Use code generation to create mocks
  - Create databases on the fly
- Each microservice owns its own database. Other services use APIs + Events
- Event principles:
  - Producers guarantee at least once delivery
  - Consumers implement idempotency
- Design schema first for all APIs and Events
  - Consume Events (not APIs) by default
- Invest in automation
  - Deployment, code generation, dependency management
- Enable teams to write amazing and simple tests
  - Drives quality, streamlines maintenance, enables continuous delivery

* Entity Component Systems and You: They're Not Just For Game Developers (Paris Buttfield-Addison, Mars Geldard, Tim Nugent)

https://www.youtube.com/watch?v=SFKR5rZBu-8

- A paradigm/architecture which is commonly used in the game industry
- ECS separate data and logic
 - Entities have IDs. They are similar to primary keys and are used to identity
   everything. Examples: camera, tree, player, enemy, particle
 - Components have data. Components are used as an alternative to hierarchies.
   So ECS favor composition over inheritance. Examples: Position component,
   Velocity component, Damage component
 - Systems have logic. These systems are often chained together and can be
   compared to functional programming. Example: Update position of every player,
   determine hits, calculate damage, render
- ECS are often combined with data-oriented design to improve performance by
  reducing cache misses. These designs can be compared to an in-memory database
- Strengths
  - Performance (data oriented design, parallelism)
  - Flexibility
  - No hierarchy
  - Have similar advantages as microservices and functional programming
- Weakness
  - More code upfront
  - Hard to keep everything in your head
  - No clear starting point

