notes/software-development/index.html

<div id="outline-container-org8d70b69" class="outline-2">
<h2 id="org8d70b69">Conversational Transformation (Jeffrey Fredrick, Douglas Squirrel)</h2>
<div class="outline-text-2" id="text-org8d70b69">
<p>
<a href="https://www.youtube.com/watch?v=RMT_Tqzf_vc">https://www.youtube.com/watch?v=RMT_Tqzf_vc</a>
</p>

<p>
Conversational Analysis with The 4 Rs
</p>

<ul class="org-ul">
<li>Record
<ul class="org-ul">
<li>Fold a piece of paper in half. Write the major points of your conversation
on the right hand side. Record what you thought (but didn't say) on the left
hand side</li>
</ul></li>
<li>Reflect
<ul class="org-ul">
<li>How many genuine questions were asked?</li>
<li>What is on the left side that isn't on the right?</li>
<li>What sets off negative reactions for you?</li>
</ul></li>
<li>Revise</li>
<li>Roleplay</li>
<li>(Repeat)</li>
<li>(Role-reversal)</li>
</ul>
</div>
</div>

<div id="outline-container-org1dc334d" class="outline-2">
<h2 id="org1dc334d">Continuous Retrospectives (Linda Rising)</h2>
<div class="outline-text-2" id="text-org1dc334d">
<p>
<a href="https://www.youtube.com/watch?v=1wzedZcSmKY">https://www.youtube.com/watch?v=1wzedZcSmKY</a>
</p>

<ul class="org-ul">
<li>In times like COVID we cannot even remember what day it is. How can we then
have a meaningful discussion (retrospective) about a long project?</li>
<li>Continuous retrospectives: Hang up a timeline and add sticky notes through out
the day. Capture ideas, questions, concerns, events, problems, success,
failure</li>
<li>Spend the last 15 minutes writing about, reflecting on lessons learned that
day</li>
<li>Guide Boards
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=DnZnb22Cgd8">https://www.youtube.com/watch?v=DnZnb22Cgd8</a></li>
<li><a href="https://mattischneider.fr/agile/guide-board/paper.pdf">https://mattischneider.fr/agile/guide-board/paper.pdf</a></li>
<li><a href="https://mattischneider.fr/anthropologie/agile/thesis">https://mattischneider.fr/anthropologie/agile/thesis</a></li>
</ul></li>
<li>Retrospectives offer different opportunities:
<ul class="org-ul">
<li>Project: long term learning (strategic)</li>
<li>Iteration: what should we do now? (tactical)</li>
<li>Continuous: small experiments</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org9022855" class="outline-2">
<h2 id="org9022855">Solving Problems the Clojure Way (Rafal Dittwald)</h2>
<div class="outline-text-2" id="text-org9022855">
<p>
<a href="https://www.youtube.com/watch?v=vK1DazRK_a0">https://www.youtube.com/watch?v=vK1DazRK_a0</a>
</p>

<ul class="org-ul">
<li>Imperative code spreads state, mutation and side effects, which makes larger
programs harder to understand and change</li>
<li>Object oriented programming tries to solve these problems through classes and
encapsulation. The preferred thinking model revolves around agents and how
they communicate with each other</li>
<li>While we cannot get rid of state, functional programming uses a set of
techniques to avoid state wherever possible. Rafal outlines a few techniques:
<ul class="org-ul">
<li><b>Minimize</b> state
<ul class="org-ul">
<li>Derive state from other state (e.g. the current player of a Tic Tac Toe
game can be derived based on the board state)</li>
<li>Use immutable data structures instead of mutation</li>
<li>Pass lambdas</li>
<li>Recursion</li>
</ul></li>
<li><b>Concentrate</b> state into fewer places</li>
<li><b>Defer</b> actions (e.g. Elm architecture)</li>
</ul></li>
<li>Given a graph of components, the typical OO approach is to keep state
separated by pushing it down as far as we can. The FP approach would be to put
all the state into the root node</li>
</ul>
</div>
</div>

<div id="outline-container-org2db99d7" class="outline-2">
<h2 id="org2db99d7">Persistent Data Structures and Managed References (Rich Hickey)</h2>
<div class="outline-text-2" id="text-org2db99d7">
<p>
<a href="https://www.infoq.com/presentations/Value-Identity-State-Rich-Hickey/">https://www.infoq.com/presentations/Value-Identity-State-Rich-Hickey/</a>
</p>

<ul class="org-ul">
<li>Pure functions have no notion of time and no effect on the world</li>
<li>Concurrency breaks variables badly
<ul class="org-ul">
<li>Might not be atomic (e.g. long)</li>
<li>Need locks or volatile keywords</li>
</ul></li>
<li>Identity: An entity we associate with a series of relates values over time
<ul class="org-ul">
<li>Can be a composite (e.g. the members of a sports team might change, but we
still consider it to be the same sports team)</li>
</ul></li>
<li>State: Value of an identity at a time</li>
<li>Value: An immutable structure (e.g. numbers, strings, &#x2026;)</li>
<li>Overall philosophy
<ul class="org-ul">
<li>Things don't change in place</li>
<li>See time as a dimension</li>
<li>The future is a function of the past (and doesn't change it)</li>
<li>Co-located entities can observe each other without cooperation</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org847a686" class="outline-2">
<h2 id="org847a686">End to end functional tests that can run in milliseconds (Nat Pryce)</h2>
<div class="outline-text-2" id="text-org847a686">
<p>
<a href="https://www.youtube.com/watch?v=Fk4rCn4YLLU">https://www.youtube.com/watch?v=Fk4rCn4YLLU</a>
</p>

<ul class="org-ul">
<li>They applied the hexagonal architecture model in combination with
"screenplays"</li>
<li>Tests can run in different scenarios (in memory, using a Browser with or
without JS, REST calls, &#x2026;)</li>
<li>They put all interactions (e.g. steps a user takes to update his mail address)
behind an interface, so that these "use cases" don't know anything about a
scenario. This technique allows the team to change an N*M mapping to an N+M
mapping</li>
<li>Gives great feedback about the actual state of the system. Such an approach
can find problems in your CDN configuration or your caching policies</li>
<li>Makes the overall system more observable</li>
<li>To test/maintain a system we need to
<ul class="org-ul">
<li>Know what the system is doing</li>
<li>Know when it has stopped doing it</li>
<li>Know when the system has failed</li>
<li>Explain what has gone wrong</li>
<li>Restore the system to a good state</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgaf0dfbe" class="outline-2">
<h2 id="orgaf0dfbe">Design Microservice Architectures the Right Way (Michael Bryzek)</h2>
<div class="outline-text-2" id="text-orgaf0dfbe">
<p>
<a href="https://www.youtube.com/watch?v=j6ow-UemzBc">https://www.youtube.com/watch?v=j6ow-UemzBc</a>
</p>

<ul class="org-ul">
<li>Describe APIs/Events/Databases (e.g. by using JSON) and invest in tooling
<ul class="org-ul">
<li>Create custom linters to ensure that common naming conventions are used</li>
<li>Use code generation to automate API creation using CI/CD</li>
<li>Use code generation to create mocks</li>
<li>Create databases on the fly</li>
</ul></li>
<li>Each microservice owns its own database. Other services use APIs + Events</li>
<li>Event principles:
<ul class="org-ul">
<li>Producers guarantee at least once delivery</li>
<li>Consumers implement idempotency</li>
</ul></li>
<li>Design schema first for all APIs and Events
<ul class="org-ul">
<li>Consume Events (not APIs) by default</li>
</ul></li>
<li>Invest in automation
<ul class="org-ul">
<li>Deployment, code generation, dependency management</li>
</ul></li>
<li>Enable teams to write amazing and simple tests
<ul class="org-ul">
<li>Drives quality, streamlines maintenance, enables continuous delivery</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org9d21e22" class="outline-2">
<h2 id="org9d21e22">Entity Component Systems and You: They're Not Just For Game Developers (Paris Buttfield-Addison, Mars Geldard, Tim Nugent)</h2>
<div class="outline-text-2" id="text-org9d21e22">
<p>
<a href="https://www.youtube.com/watch?v=SFKR5rZBu-8">https://www.youtube.com/watch?v=SFKR5rZBu-8</a>
</p>

<ul class="org-ul">
<li>A paradigm/architecture which is commonly used in the game industry</li>
<li>ECS separate data and logic
<ul class="org-ul">
<li>Entities have IDs. They are similar to primary keys and are used to identity
everything. Examples: camera, tree, player, enemy, particle</li>
<li>Components have data. Components are used as an alternative to hierarchies.
So ECS favor composition over inheritance. Examples: Position component,
Velocity component, Damage component</li>
<li>Systems have logic. These systems are often chained together and can be
compared to functional programming. Example: Update position of every player,
determine hits, calculate damage, render</li>
</ul></li>
<li>ECS are often combined with data-oriented design to improve performance by
reducing cache misses. These designs can be compared to an in-memory database</li>
<li>Strengths
<ul class="org-ul">
<li>Performance (data oriented design, parallelism)</li>
<li>Flexibility</li>
<li>No hierarchy</li>
<li>Have similar advantages as microservices and functional programming</li>
</ul></li>
<li>Weakness
<ul class="org-ul">
<li>More code upfront</li>
<li>Hard to keep everything in your head</li>
<li>No clear starting point</li>
</ul></li>
</ul>
</div>
</div>
