content/notes/software-development.org
* Programming Is The Easy Part (J. B. Rainsberger)

https://www.youtube.com/watch?v=SbGiSH_8UGk

A lot of high level software design principles boil down to a linear combination
of "remove duplication" and "improve names".

* Modern SQL A lot has changed since SQL 92 (Markus Winand)

https://www.youtube.com/watch?v=rpw_x8TtqTo

SQL has changed a lot, though most developers only know the 1992 standard

- *WITH* clause: create "private" views to make a query more readable
- *WITH RECURSIVE*: is an implementation of loops in SQL. It can be used to
  walk hierarchies
- *GROUPING SETS*: use several GROUP BY statements at the same time
- *FILTER*: Adds WHERE expressions to aggregates
- *OVER* and *PARTITION BY*: Aggregates without GROUP BY. Can be used to
  implement features such as row-based balancing
- *FETCH FIRST*: also known as LIMIT
- *OFFSET*: gives the remaining data when using FETCH FIRST, but there are
  traps. Don't use it
- *OVER*: window functions
- *System Versioning*: Can be used to show tables at a given time. Adds audit
  features to destructive changes such as INSERT, UPDATE or DELETE

* Testing as an equal 1st class citizen to coding (Jon Jagger)

https://www.youtube.com/watch?v=1u6DdiFFH6Q

- The Equilibrium law: stable systems tend to oppose their own proper function
- All changes can be understood as the effort to maintain some constancy, and
  all constancy as maintained through change
- You will not increase the speed of your car if you think that your brakes are
  unreliable
- Tests act like brakes when developing software
- Are you confident enough to delete "dead" code?

* Technical Leadership and Glue Work (Tanya Reilly)

https://www.youtube.com/watch?v=KClAPipnKqw

- Glue work
  - is work that makes the whole teams better
  - is expected when you are senior
  - and risky when you are not
  - (people might not be rewarded for it)
- Women tend to volunteer more often to do unpromotable work than men
  - Men also volunteer less because they know that women will step in if no one
    volunteers
- What do you want to get better at?
- The vast majority of our learning happens at our job

* The Only Unbreakable Law (Casey Muratori)

https://www.youtube.com/watch?v=5IUj1EZwpJY

- Conway's law states that a piece of software tends to reflect a company's
  communication structures (its org chart)
- The intended title of this talk should have been Conway's nightmare
- What Conway did not anticipate: A piece of software does not only reflect the
  current org chart, but it most likely also contains fragments of *previous*
  org charts
- Windows contains at least four different volume controls which were all
  created in different versions of Windows
- We create organizations and groups to tackle problems that we cannot solve
  alone. They are in a way a necessity, but they are not inherently "good"
- Developers tend to do the same thing when they are writing code: They create
  class hierarchies so they can divide a problem which they cannot keep in their
  head. Just like org charts, they might be too complicated or inefficient

* Improving eBay's Development Velocity (Randy Shoup and Mark Weinberg)

https://www.youtube.com/watch?v=Qgjs0IA114E

- Randy and Mark used the Accelerate book
- Used DORA metrics to track progress
- Teams delivered >2x the features
- Focused on removing bottlenecks
- How could we deliver once per day? - Here is a list of 20 things that are
  holding us back
- CEO: "The most important initiative at the company. Go faster!"

* Uncoupling (Michael Nygard)

https://www.youtube.com/watch?v=mAw4ygX1c-4

*Coupling*

- Determines degree of freedom
- Enables some movement
- Inhibits other movement
- Connects effects
- Is necessary and inescapable

*Kinds of Coupling*

- Operational: Consumer cannot run without the provider
- Development: Changes in producer and consumer must be coordinated
- Semantic: Change together because of shared concepts
- Functional: Change together because of shared responsibility
- Incidental: Change together for no good reason

*Composability*

- Is inversely proportional to the number of interfaces
- Is inversely proportional to the number of data types

* Make Impacts Not Software (Gojko Adzic)

https://www.youtube.com/watch?v=GnK_n9Udhhs

- Typical software road maps are better described as tunnels, since these "maps"
  typically only contain a single road/approach
- A real road map contains several different ways to reach a specific goals
- Before the invention of GPS a long trip involved a lot of upfront planning
- A GPS eliminates this upfront planning by recalculating potential routes
  depending on-the-fly (e.g. in case of heavy traffic or an accident)
- Shipping small increments are the equivalent to a GPS recalculation process.
  We can use fast feedback to decide how to change our route (by using a road
  map)
- Software projects typically do not have a specific destination. Most of the
  time the "real" destination arises while we are developing something new
- People measure what's easy, not was is important
- Story points, time estimates or bug counts are negative metrics. They tell you
  when something is wrong, but they cannot tell you if everything is alright.
  "Zero bugs" could mean "great quality" but it could also mean "no or poor
  testing" or "nothing new was delivered". In other words: absence of evidence
  is not evidence of absence
- https://www.impactmapping.org/

