notes/software-development/index.html

<div id="outline-container-orgcafa1ae" class="outline-2">
<h2 id="orgcafa1ae">Programming Is The Easy Part (J. B. Rainsberger)</h2>
<div class="outline-text-2" id="text-orgcafa1ae">
<p>
<a href="https://www.youtube.com/watch?v=SbGiSH_8UGk">https://www.youtube.com/watch?v=SbGiSH_8UGk</a>
</p>

<p>
A lot of high level software design principles boil down to a linear combination
of "remove duplication" and "improve names".
</p>
</div>
</div>

<div id="outline-container-org985704c" class="outline-2">
<h2 id="org985704c">Modern SQL A lot has changed since SQL 92 (Markus Winand)</h2>
<div class="outline-text-2" id="text-org985704c">
<p>
<a href="https://www.youtube.com/watch?v=rpw_x8TtqTo">https://www.youtube.com/watch?v=rpw_x8TtqTo</a>
</p>

<p>
SQL has changed a lot, though most developers only know the 1992 standard
</p>

<ul class="org-ul">
<li><b>WITH</b> clause: create "private" views to make a query more readable</li>
<li><b>WITH RECURSIVE</b>: is an implementation of loops in SQL. It can be used to
walk hierarchies</li>
<li><b>GROUPING SETS</b>: use several GROUP BY statements at the same time</li>
<li><b>FILTER</b>: Adds WHERE expressions to aggregates</li>
<li><b>OVER</b> and <b>PARTITION BY</b>: Aggregates without GROUP BY. Can be used to
implement features such as row-based balancing</li>
<li><b>FETCH FIRST</b>: also known as LIMIT</li>
<li><b>OFFSET</b>: gives the remaining data when using FETCH FIRST, but there are
traps. Don't use it</li>
<li><b>OVER</b>: window functions</li>
<li><b>System Versioning</b>: Can be used to show tables at a given time. Adds audit
features to destructive changes such as INSERT, UPDATE or DELETE</li>
</ul>
</div>
</div>

<div id="outline-container-orgb252763" class="outline-2">
<h2 id="orgb252763">Testing as an equal 1st class citizen to coding (Jon Jagger)</h2>
<div class="outline-text-2" id="text-orgb252763">
<p>
<a href="https://www.youtube.com/watch?v=1u6DdiFFH6Q">https://www.youtube.com/watch?v=1u6DdiFFH6Q</a>
</p>

<ul class="org-ul">
<li>The Equilibrium law: stable systems tend to oppose their own proper function</li>
<li>All changes can be understood as the effort to maintain some constancy, and
all constancy as maintained through change</li>
<li>You will not increase the speed of your car if you think that your brakes are
unreliable</li>
<li>Tests act like brakes when developing software</li>
<li>Are you confident enough to delete "dead" code?</li>
</ul>
</div>
</div>

<div id="outline-container-org3352061" class="outline-2">
<h2 id="org3352061">Technical Leadership and Glue Work (Tanya Reilly)</h2>
<div class="outline-text-2" id="text-org3352061">
<p>
<a href="https://www.youtube.com/watch?v=KClAPipnKqw">https://www.youtube.com/watch?v=KClAPipnKqw</a>
</p>

<ul class="org-ul">
<li>Glue work
<ul class="org-ul">
<li>is work that makes the whole teams better</li>
<li>is expected when you are senior</li>
<li>and risky when you are not</li>
<li>(people might not be rewarded for it)</li>
</ul></li>
<li>Women tend to volunteer more often to do unpromotable work than men
<ul class="org-ul">
<li>Men also volunteer less because they know that women will step in if no one
volunteers</li>
</ul></li>
<li>What do you want to get better at?</li>
<li>The vast majority of our learning happens at our job</li>
</ul>
</div>
</div>

<div id="outline-container-org4055ae6" class="outline-2">
<h2 id="org4055ae6">The Only Unbreakable Law (Casey Muratori)</h2>
<div class="outline-text-2" id="text-org4055ae6">
<p>
<a href="https://www.youtube.com/watch?v=5IUj1EZwpJY">https://www.youtube.com/watch?v=5IUj1EZwpJY</a>
</p>

<ul class="org-ul">
<li>Conway's law states that a piece of software tends to reflect a company's
communication structures (its org chart)</li>
<li>The intended title of this talk should have been Conway's nightmare</li>
<li>What Conway did not anticipate: A piece of software does not only reflect the
current org chart, but it most likely also contains fragments of <b>previous</b>
org charts</li>
<li>Windows contains at least four different volume controls which were all
created in different versions of Windows</li>
<li>We create organizations and groups to tackle problems that we cannot solve
alone. They are in a way a necessity, but they are not inherently "good"</li>
<li>Developers tend to do the same thing when they are writing code: They create
class hierarchies so they can divide a problem which they cannot keep in their
head. Just like org charts, they might be too complicated or inefficient</li>
</ul>
</div>
</div>

<div id="outline-container-orgbf0eebf" class="outline-2">
<h2 id="orgbf0eebf">Improving eBay's Development Velocity (Randy Shoup and Mark Weinberg)</h2>
<div class="outline-text-2" id="text-orgbf0eebf">
<p>
<a href="https://www.youtube.com/watch?v=Qgjs0IA114E">https://www.youtube.com/watch?v=Qgjs0IA114E</a>
</p>

<ul class="org-ul">
<li>Randy and Mark used the Accelerate book</li>
<li>Used DORA metrics to track progress</li>
<li>Teams delivered &gt;2x the features</li>
<li>Focused on removing bottlenecks</li>
<li>How could we deliver once per day? - Here is a list of 20 things that are
holding us back</li>
<li>CEO: "The most important initiative at the company. Go faster!"</li>
</ul>
</div>
</div>

<div id="outline-container-orgd649559" class="outline-2">
<h2 id="orgd649559">Uncoupling (Michael Nygard)</h2>
<div class="outline-text-2" id="text-orgd649559">
<p>
<a href="https://www.youtube.com/watch?v=mAw4ygX1c-4">https://www.youtube.com/watch?v=mAw4ygX1c-4</a>
</p>

<p>
<b>Coupling</b>
</p>

<ul class="org-ul">
<li>Determines degree of freedom</li>
<li>Enables some movement</li>
<li>Inhibits other movement</li>
<li>Connects effects</li>
<li>Is necessary and inescapable</li>
</ul>

<p>
<b>Kinds of Coupling</b>
</p>

<ul class="org-ul">
<li>Operational: Consumer cannot run without the provider</li>
<li>Development: Changes in producer and consumer must be coordinated</li>
<li>Semantic: Change together because of shared concepts</li>
<li>Functional: Change together because of shared responsibility</li>
<li>Incidental: Change together for no good reason</li>
</ul>

<p>
<b>Composability</b>
</p>

<ul class="org-ul">
<li>Is inversely proportional to the number of interfaces</li>
<li>Is inversely proportional to the number of data types</li>
</ul>
</div>
</div>

<div id="outline-container-org547b32c" class="outline-2">
<h2 id="org547b32c">Make Impacts Not Software (Gojko Adzic)</h2>
<div class="outline-text-2" id="text-org547b32c">
<p>
<a href="https://www.youtube.com/watch?v=GnK_n9Udhhs">https://www.youtube.com/watch?v=GnK_n9Udhhs</a>
</p>

<ul class="org-ul">
<li>Typical software road maps are better described as tunnels, since these "maps"
typically only contain a single road/approach</li>
<li>A real road map contains several different ways to reach a specific goals</li>
<li>Before the invention of GPS a long trip involved a lot of upfront planning</li>
<li>A GPS eliminates this upfront planning by recalculating potential routes
depending on-the-fly (e.g. in case of heavy traffic or an accident)</li>
<li>Shipping small increments are the equivalent to a GPS recalculation process.
We can use fast feedback to decide how to change our route (by using a road
map)</li>
<li>Software projects typically do not have a specific destination. Most of the
time the "real" destination arises while we are developing something new</li>
<li>People measure what's easy, not was is important</li>
<li>Story points, time estimates or bug counts are negative metrics. They tell you
when something is wrong, but they cannot tell you if everything is alright.
"Zero bugs" could mean "great quality" but it could also mean "no or poor
testing" or "nothing new was delivered". In other words: absence of evidence
is not evidence of absence</li>
<li><a href="https://www.impactmapping.org/">https://www.impactmapping.org/</a></li>
</ul>
</div>
</div>
