notes/software-development/index.html

<div id="outline-container-org0e967e3" class="outline-2">
<h2 id="org0e967e3">Protect Yourself Against Supply Chain Attacks (Rob Bos)</h2>
<div class="outline-text-2" id="text-org0e967e3">
<p>
<a href="https://www.youtube.com/watch?v=00R1JGBQEJg">https://www.youtube.com/watch?v=00R1JGBQEJg</a>
</p>

<ul class="org-ul">
<li>Libraries used by your application and tooling used to build your application</li>
<li>Supply Chain Confusion (typo squatting, namespace shadowing, configuration
files, pipeline attacks, pipeline artifact attacks)</li>
<li>Typo squatting: a malicious copy of a well known package is published using a
slightly different name (e.g. <code>coreenv</code> and <code>core-env</code>)</li>
<li>Some package managers offer a namespace feature (e.g. <code>@azure/some-package</code>
instead of just using <code>some-package</code>)</li>
<li>You not only want to know which packages (and their versions) you are using.
You also want to know where you got these packages from</li>
<li>Protect yourself using software composition analysis (AST or DAST -
Static/Dynamic Application Security Testing)</li>
<li>Package manager scanners: WhiteSource, BlackDuck, GitHub Dependabot, snyk.io</li>
<li>You can use CVE databases to check that your packages do not contain known
issues</li>
<li>We want to find issues as fast as possible. In the best case we find an issue
before we commit code or run a CI build</li>
<li>Frameworks:
<ul class="org-ul">
<li>OWASP Software Component Verification Standard (SCVS)</li>
<li>Supply Chain Levels for Software Artifacts (SLSA)</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgd124797" class="outline-2">
<h2 id="orgd124797">Monitoring Is Not Observability (Baron Schwartz)</h2>
<div class="outline-text-2" id="text-orgd124797">
<p>
<a href="https://www.youtube.com/watch?v=fBDI7F9PjlI">https://www.youtube.com/watch?v=fBDI7F9PjlI</a>
</p>

<ul class="org-ul">
<li>Definitions
<ul class="org-ul">
<li>Observability: an attribute of a system</li>
<li>Instrumentation: measurement points</li>
<li>Telemetry: the measurements themselves</li>
<li>Analytics: turning telemetry into answers</li>
<li>Monitoring: checking/evaluating system state</li>
</ul></li>
<li>Events, Logs, Metrics, Traces</li>
<li>It's all derived from events</li>
<li>Kinds of telemetry
<ul class="org-ul">
<li>USE: Utilization, saturation, error</li>
<li>RED: Requests, errors, duration</li>
<li>SRE Book: Latency, traffic, errors and saturation</li>
<li>Queuing theory</li>
<li>Little's law</li>
<li>Universal scalability law</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org7710529" class="outline-2">
<h2 id="org7710529">Working at the Center of the Cyclone (Dr. Richard Cook)</h2>
<div class="outline-text-2" id="text-org7710529">
<p>
<a href="https://www.youtube.com/watch?v=3ZP98stDUf0">https://www.youtube.com/watch?v=3ZP98stDUf0</a>
</p>

<ul class="org-ul">
<li>Complexity is change</li>
<li>It's not surprising that your system sometimes fail. What is surprising that
it ever works at all</li>
<li>You build systems differently when you expect them to fail</li>
<li>Failure is normal. Failed state is the normal state</li>
<li>You need to build an organization that is able to recover from failure</li>
<li>People are part of "the system"</li>
<li>You never see "the system", you only see a representation (what you see on
your screen)</li>
<li>An incident is something that occurs in the mind of people who read
representations of a system</li>
<li>No mental model is "the system"</li>
<li>Ordinary firms experience one to five acknowledged events per day</li>
<li>As the complexity of a system increases, the accuracy of any agent's model of
that system decreases</li>
<li>Rollbacks do not keep you safe</li>
<li>You need to consider "the system" and "the organization" (which are part of
the system) to be successful</li>
<li>Incidents are bits of wisdom. They show you where your mental model differs
from "the system"</li>
</ul>
</div>
</div>

<div id="outline-container-org5dbaa2a" class="outline-2">
<h2 id="org5dbaa2a">Resilience In Complex Adaptive Systems (Dr. Richard Cook)</h2>
<div class="outline-text-2" id="text-org5dbaa2a">
<p>
<a href="https://www.youtube.com/watch?v=PGLYEDpNu60">https://www.youtube.com/watch?v=PGLYEDpNu60</a>
</p>

<ul class="org-ul">
<li>Rasmussen's system model
<ul class="org-ul">
<li>Economic failure boundary</li>
<li>Accident boundary</li>
<li>Unacceptable workload boundary</li>
</ul></li>
<li>The operating point tends to move towards the accident boundary</li>
<li>If you get people together for a meeting about how important some topic is,
you know you have failed</li>
<li>We introduce a margin which should keep us from reaching the accident
boundary. This also applies to speed limits or telling your kids "no, the
stove is hot!". The problem is that we don't really know where the accident
boundary is</li>
<li>Normalization of deviance: Crossing over the margin line over and over without
a problem makes us wonder what the big deal is. Is this margin too
conservative? We are "flirting" with the margin</li>
<li>Resilience: monitoring, reacting, anticipating and learning activities</li>
</ul>
</div>
</div>

<div id="outline-container-orgcea17a0" class="outline-2">
<h2 id="orgcea17a0">How Complex Systems Fail (Dr. Richard Cook)</h2>
<div class="outline-text-2" id="text-orgcea17a0">
<p>
<a href="https://www.youtube.com/watch?v=2S0k12uZR14">https://www.youtube.com/watch?v=2S0k12uZR14</a>
</p>

<ul class="org-ul">
<li><a href="https://how.complexsystems.fail">https://how.complexsystems.fail</a></li>
<li>We have the "as imagined" and the "as found" world. These are pretty different
worlds!</li>
<li>We design for reliability
<ul class="org-ul">
<li>stiff boundaries, layers, formalism</li>
<li>defense in depth</li>
<li>redundancy</li>
<li>interference protection</li>
<li>assurance</li>
<li>accountability</li>
</ul></li>
<li>We want resilience
<ul class="org-ul">
<li>withstand transients</li>
<li>recover swiftly and smoothly from failures</li>
<li>prioritize to serve high level goals</li>
<li>recognize and respond to abnormal situations</li>
<li>adapt to change</li>
</ul></li>
<li>The time between maintenance is zero. Continuous maintenance should be part of
the design</li>
<li>Reveal the actual controls to your operators so that they can help you in case
of accidents. Developers tend to design systems that make it impossible for
people to do things. We are trying to protect systems from people</li>
<li>Heavy machines have actual markers that show where you can lift them, since
the manufacturers know that you will move them. We should also consider
similar scenarios when dealing with software</li>
<li>Support mental simulation by giving operators insight into the system</li>
<li>Black boxes (hiding all details behind layers of abstractions) are a big
mistake. We have to know the inside of a black box to reason about it</li>
<li>Resilience agenda:
<ul class="org-ul">
<li>Operators are competent to hold the keys to the systems we build</li>
<li>Make resilience engineering the first priority of design for next gen
systems</li>
<li>Commit resources to discovering, understanding and supporting resilience
through the system life-cycle</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orge48312c" class="outline-2">
<h2 id="orge48312c">Sleeping with the enemy (Gojko Adzic)</h2>
<div class="outline-text-2" id="text-orge48312c">
<p>
<a href="https://www.youtube.com/watch?v=hIMwTzAAQ-w">https://www.youtube.com/watch?v=hIMwTzAAQ-w</a>
</p>

<ul class="org-ul">
<li>Manual testing is a bottleneck</li>
<li>Let developers watch testers so that they can build understanding and trust</li>
<li>A software architect is somebody who writes very small parts of code for
critical systems. Most of his time is spent on mentoring and helping others do
their job</li>
<li>The role of a tester should be similar to the role of a software architect, so
let's turn testers into "test architects"</li>
<li>This approach inverts the flow. Developers no longer push code to testers</li>
</ul>

<p>
Some quotes:
</p>

<ul class="org-ul">
<li>"It makes much more sense to get the programmers involved to automate the
tests while testers come up with the right test cases to automate."</li>
<li>"I hate story points! Story points are useless! Story points measure effort,
they are so easy to cheat, story points don't measure outcome. So, what we
need to look at is: what is the outcome? how do we measure the outcomes? And
then, that measures the productivity because that is what really productivity
is. I don't care about lines of code, tests cases produced&#x2026;What is the
outcome?"</li>
</ul>
</div>
</div>
