content/notes/software-development.org
* Diagrams as Code 2.0 (Simon Brown)

https://www.youtube.com/watch?v=Za1-v4Zkq5E

- Simon is the author of https://c4model.com/
- The C4 model describes a set of abstractions which can be used to create
  architecture diagrams that behave similar to Google Maps, where you can zoom
  in and out of a map to change the amount of details you see. A legend is used
  to explain notation
- Diagrams as code 1.0 is a nice way to create version controlled diagrams
- Diagrams as code 2.0 describes an overall model of your architecture which can
  then be used to create one or more views (diagrams as code 1.0)
- Simon was created open source tooling to describe an architecture model using
  the [[https://github.com/structurizr/dsl][Structurizr DSL]]

* Software Architecture, Team Topologies and Complexity Science (James Lewis)

https://www.youtube.com/watch?v=uAwJEFLJunk

- The book "Team Topologies" outlines the four fundamental teams you need to
  build software fast:
  - Stream-aligned teams
  - Enabling teams
  - Complicated subsystem teams
  - Platform teams
- Mice, humans and elephants have roughly the same amount of heartbeats in their
  lifetime. They also have the same blood pressure. The bigger a mammal, the
  slower they live
- Complex adaptive systems (mammals, cities or companies) show sub-linear
  scaling: doubling one factor (e.g. size) does not double other factors (e.g.
  calorie intake, cost of building streets, revenue)
- Hierarchical fractal networks scale following a power law with an exponent of
  less than one
- Queues create back-pressure. Putting a queue into an information flow pauses
  the flow
- Larger organizations spend less of their revenue on R&D
- Cities show more than one type of scaling:
  - Super-linear: innovation, wages, number of professionals, crime, disease,
    pollution (social network)
  - Sub-linear: road length, number of petrol stations and restaurants, water
    pipes, electricity cables (hierarchical network)

* Automation Is Hard & We Are Doing It Wrong (Johan Abildskov)

https://www.youtube.com/watch?v=JU5niXIrK3Y

- What is DevOps? One Definition: Culture, Automation, Lean, Measuring, Sharing
- Automation is not a luxury. It's a permission to play
  - "I don't want to buy software from people who are wasting their time"
- "But our customers won't pay for automation" - well, they most likely don't
  want to pay for your dailies, retrospectives or coffee breaks either
- Minimize the cost of adding one more engineer
- Maximize the value of adding one more engineer
- Why digitalization will kill your company too
  - Limited software skills in senior leadership
  - Ambidexterity: solve today's challenges while preparing for future needs
  - Leaders believe that digitalization is an R&D problem
  - Justify their lack of initiative by referring to the lack of desire for
    change from their most valuable customers
- Automation is not complex. An excavator is an obvious upgrade to a shovel
- Automating simple things is simple. Automating complex things might be
  impossible (without losing your sanity)
- Industry and technology stack doesn't matter. Architecture does (Nicole
  Forsgren, PhD)
- Automation is software. We should treat it as such!
  - Use version control
  - Create documentation
  - Have tests
- Monitor your automation. Use circuit breakers
  - Does my automation do something silly?
  - Use overrides but add checks to find stale overrides
- Idempotency is your friend
- Jevons Paradox: Increased efficiency != reduced consumption
- Keep in mind that an increase in automation can increase manual work (in other
  areas)
- Automation is way more than cost-down

* Engineering Documentation (Lorna Jane Mitchell)

https://www.youtube.com/watch?v=Z5OrR99OpiY

- Documentation enables customer success
- An investment that scales
- https://diataxis.fr/
- Use *really* good search
- Use the same tools and workflows as for code
- Prose linter https://vale.sh/

* Kinder, es tut mir undendlich leid (Martin Leyrer)

https://www.youtube.com/watch?v=dpQOKwYOhLQ

"We build our computer (systems) the way we build our cities: Over time, without
a plan, on top of ruins" - Ellen Ullman

* An Introduction to Residuality Theory (Barry O'Reilly)

https://www.youtube.com/watch?v=0wcUG2EV-7E

- How can we apply complexity theory to software development?
- Creating software can be boiled down to a two step algorithm:
  - a random simulation of our environments, followed by
  - an NKP analysis
    - N: the amount of components
    - K: the amount of connections between components. More connections leads to
      more chaos
    - P: a bias between connections. A higher bias reduces chaos
- Stressors can be categorized using attractors. We often design a system for a
  single attractor, which is a mistake
- A good start: "What if a giant laser lizard burns down our city? What's your
  residue?"
- A matrix which maps components and stressors can help you to identify
  non-function requirements. It shows you hidden coupling and weak spots
- The presenter also shows a concrete example using the architecture of a
  business around charging electric cars

* The Case for Technical Excellence (Kevlin Henney)

https://www.youtube.com/watch?v=LLEXAdO3X1o

- Some organizations seem to believe that feature work and technical work are
  mutual exclusive and that they can choose to focus on either. Features are
  made of software. This sounds obvious and trivial, but just highlights that
  technical and feature work are deeply linked. There is no choice
- The agile manifesto mentions that technical excellence enhances agility
- Architecture represents significant design decisions, where significant is
  measured by cost of change. You are dealing with software, you can deal
  whatever you want. To interesting question is how fast/cheap can you do a
  change?
- Technical neglect is the cause of technical debt

* A New Era for Database Design with TigerBeetle (Joran Greef)

https://www.youtube.com/watch?v=_jfOk4L7CiY

- TigerBeetle is a new type of database to track financial transactions
- Databases still have room for innovation and improvement
- Buffered I/O is broken, fsync has subtle issues which can cause loss of data
- Databases that rely on fsync are trying to change fundamental design
  decisions, which is hard work for a project with a long history
- TigerBeetle uses two write-ahead logs
- Storage faults force us to reconsider database design
- We need to move beyond a crash safety (power loss) model

