notes/software-development/index.html

<div id="outline-container-org77ab347" class="outline-2">
<h2 id="org77ab347">Diagrams as Code 2.0 (Simon Brown)</h2>
<div class="outline-text-2" id="text-org77ab347">
<p>
<a href="https://www.youtube.com/watch?v=Za1-v4Zkq5E">https://www.youtube.com/watch?v=Za1-v4Zkq5E</a>
</p>

<ul class="org-ul">
<li>Simon is the author of <a href="https://c4model.com/">https://c4model.com/</a></li>
<li>The C4 model describes a set of abstractions which can be used to create
architecture diagrams that behave similar to Google Maps, where you can zoom
in and out of a map to change the amount of details you see. A legend is used
to explain notation</li>
<li>Diagrams as code 1.0 is a nice way to create version controlled diagrams</li>
<li>Diagrams as code 2.0 describes an overall model of your architecture which can
then be used to create one or more views (diagrams as code 1.0)</li>
<li>Simon was created open source tooling to describe an architecture model using
the <a href="https://github.com/structurizr/dsl">Structurizr DSL</a></li>
</ul>
</div>
</div>

<div id="outline-container-org2303ae2" class="outline-2">
<h2 id="org2303ae2">Software Architecture, Team Topologies and Complexity Science (James Lewis)</h2>
<div class="outline-text-2" id="text-org2303ae2">
<p>
<a href="https://www.youtube.com/watch?v=uAwJEFLJunk">https://www.youtube.com/watch?v=uAwJEFLJunk</a>
</p>

<ul class="org-ul">
<li>The book "Team Topologies" outlines the four fundamental teams you need to
build software fast:
<ul class="org-ul">
<li>Stream-aligned teams</li>
<li>Enabling teams</li>
<li>Complicated subsystem teams</li>
<li>Platform teams</li>
</ul></li>
<li>Mice, humans and elephants have roughly the same amount of heartbeats in their
lifetime. They also have the same blood pressure. The bigger a mammal, the
slower they live</li>
<li>Complex adaptive systems (mammals, cities or companies) show sub-linear
scaling: doubling one factor (e.g. size) does not double other factors (e.g.
calorie intake, cost of building streets, revenue)</li>
<li>Hierarchical fractal networks scale following a power law with an exponent of
less than one</li>
<li>Queues create back-pressure. Putting a queue into an information flow pauses
the flow</li>
<li>Larger organizations spend less of their revenue on R&amp;D</li>
<li>Cities show more than one type of scaling:
<ul class="org-ul">
<li>Super-linear: innovation, wages, number of professionals, crime, disease,
pollution (social network)</li>
<li>Sub-linear: road length, number of petrol stations and restaurants, water
pipes, electricity cables (hierarchical network)</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org6c7ffd8" class="outline-2">
<h2 id="org6c7ffd8">Automation Is Hard &amp; We Are Doing It Wrong (Johan Abildskov)</h2>
<div class="outline-text-2" id="text-org6c7ffd8">
<p>
<a href="https://www.youtube.com/watch?v=JU5niXIrK3Y">https://www.youtube.com/watch?v=JU5niXIrK3Y</a>
</p>

<ul class="org-ul">
<li>What is DevOps? One Definition: Culture, Automation, Lean, Measuring, Sharing</li>
<li>Automation is not a luxury. It's a permission to play
<ul class="org-ul">
<li>"I don't want to buy software from people who are wasting their time"</li>
</ul></li>
<li>"But our customers won't pay for automation" - well, they most likely don't
want to pay for your dailies, retrospectives or coffee breaks either</li>
<li>Minimize the cost of adding one more engineer</li>
<li>Maximize the value of adding one more engineer</li>
<li>Why digitalization will kill your company too
<ul class="org-ul">
<li>Limited software skills in senior leadership</li>
<li>Ambidexterity: solve today's challenges while preparing for future needs</li>
<li>Leaders believe that digitalization is an R&amp;D problem</li>
<li>Justify their lack of initiative by referring to the lack of desire for
change from their most valuable customers</li>
</ul></li>
<li>Automation is not complex. An excavator is an obvious upgrade to a shovel</li>
<li>Automating simple things is simple. Automating complex things might be
impossible (without losing your sanity)</li>
<li>Industry and technology stack doesn't matter. Architecture does (Nicole
Forsgren, PhD)</li>
<li>Automation is software. We should treat it as such!
<ul class="org-ul">
<li>Use version control</li>
<li>Create documentation</li>
<li>Have tests</li>
</ul></li>
<li>Monitor your automation. Use circuit breakers
<ul class="org-ul">
<li>Does my automation do something silly?</li>
<li>Use overrides but add checks to find stale overrides</li>
</ul></li>
<li>Idempotency is your friend</li>
<li>Jevons Paradox: Increased efficiency != reduced consumption</li>
<li>Keep in mind that an increase in automation can increase manual work (in other
areas)</li>
<li>Automation is way more than cost-down</li>
</ul>
</div>
</div>

<div id="outline-container-org334355d" class="outline-2">
<h2 id="org334355d">Engineering Documentation (Lorna Jane Mitchell)</h2>
<div class="outline-text-2" id="text-org334355d">
<p>
<a href="https://www.youtube.com/watch?v=Z5OrR99OpiY">https://www.youtube.com/watch?v=Z5OrR99OpiY</a>
</p>

<ul class="org-ul">
<li>Documentation enables customer success</li>
<li>An investment that scales</li>
<li><a href="https://diataxis.fr/">https://diataxis.fr/</a></li>
<li>Use <b>really</b> good search</li>
<li>Use the same tools and workflows as for code</li>
<li>Prose linter <a href="https://vale.sh/">https://vale.sh/</a></li>
</ul>
</div>
</div>

<div id="outline-container-org85f4f85" class="outline-2">
<h2 id="org85f4f85">Kinder, es tut mir undendlich leid (Martin Leyrer)</h2>
<div class="outline-text-2" id="text-org85f4f85">
<p>
<a href="https://www.youtube.com/watch?v=dpQOKwYOhLQ">https://www.youtube.com/watch?v=dpQOKwYOhLQ</a>
</p>

<p>
"We build our computer (systems) the way we build our cities: Over time, without
a plan, on top of ruins" - Ellen Ullman
</p>
</div>
</div>

<div id="outline-container-orgaf34d52" class="outline-2">
<h2 id="orgaf34d52">An Introduction to Residuality Theory (Barry O'Reilly)</h2>
<div class="outline-text-2" id="text-orgaf34d52">
<p>
<a href="https://www.youtube.com/watch?v=0wcUG2EV-7E">https://www.youtube.com/watch?v=0wcUG2EV-7E</a>
</p>

<ul class="org-ul">
<li>How can we apply complexity theory to software development?</li>
<li>Creating software can be boiled down to a two step algorithm:
<ul class="org-ul">
<li>a random simulation of our environments, followed by</li>
<li>an NKP analysis
<ul class="org-ul">
<li>N: the amount of components</li>
<li>K: the amount of connections between components. More connections leads to
more chaos</li>
<li>P: a bias between connections. A higher bias reduces chaos</li>
</ul></li>
</ul></li>
<li>Stressors can be categorized using attractors. We often design a system for a
single attractor, which is a mistake</li>
<li>A good start: "What if a giant laser lizard burns down our city? What's your
residue?"</li>
<li>A matrix which maps components and stressors can help you to identify
non-function requirements. It shows you hidden coupling and weak spots</li>
<li>The presenter also shows a concrete example using the architecture of a
business around charging electric cars</li>
</ul>
</div>
</div>

<div id="outline-container-orgab608ed" class="outline-2">
<h2 id="orgab608ed">The Case for Technical Excellence (Kevlin Henney)</h2>
<div class="outline-text-2" id="text-orgab608ed">
<p>
<a href="https://www.youtube.com/watch?v=LLEXAdO3X1o">https://www.youtube.com/watch?v=LLEXAdO3X1o</a>
</p>

<ul class="org-ul">
<li>Some organizations seem to believe that feature work and technical work are
mutual exclusive and that they can choose to focus on either. Features are
made of software. This sounds obvious and trivial, but just highlights that
technical and feature work are deeply linked. There is no choice</li>
<li>The agile manifesto mentions that technical excellence enhances agility</li>
<li>Architecture represents significant design decisions, where significant is
measured by cost of change. You are dealing with software, you can deal
whatever you want. To interesting question is how fast/cheap can you do a
change?</li>
<li>Technical neglect is the cause of technical debt</li>
</ul>
</div>
</div>

<div id="outline-container-orgcbd3fc6" class="outline-2">
<h2 id="orgcbd3fc6">A New Era for Database Design with TigerBeetle (Joran Greef)</h2>
<div class="outline-text-2" id="text-orgcbd3fc6">
<p>
<a href="https://www.youtube.com/watch?v=_jfOk4L7CiY">https://www.youtube.com/watch?v=_jfOk4L7CiY</a>
</p>

<ul class="org-ul">
<li>TigerBeetle is a new type of database to track financial transactions</li>
<li>Databases still have room for innovation and improvement</li>
<li>Buffered I/O is broken, fsync has subtle issues which can cause loss of data</li>
<li>Databases that rely on fsync are trying to change fundamental design
decisions, which is hard work for a project with a long history</li>
<li>TigerBeetle uses two write-ahead logs</li>
<li>Storage faults force us to reconsider database design</li>
<li>We need to move beyond a crash safety (power loss) model</li>
</ul>
</div>
</div>
